{
  "species": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<UNK_SPECIES>": 2,
    "Abomasnow": 3,
    "Alcremie": 4,
    "Alomomola": 5,
    "Altaria": 6,
    "Ambipom": 7,
    "Amoonguss": 8,
    "Ampharos": 9,
    "Annihilape": 10,
    "Appletun": 11,
    "Araquanid": 12,
    "Arbok": 13,
    "Arboliva": 14,
    "Arcanine": 15,
    "Arceus": 16,
    "Archaludon": 17,
    "Ariados": 18,
    "Armarouge": 19,
    "Articuno": 20,
    "Avalugg": 21,
    "Azelf": 22,
    "Azumarill": 23,
    "Banette": 24,
    "Barraskewda": 25,
    "Basculegion": 26,
    "Basculin": 27,
    "Bastiodon": 28,
    "Baxcalibur": 29,
    "Beartic": 30,
    "Bellibolt": 31,
    "Bellossom": 32,
    "Blastoise": 33,
    "Blaziken": 34,
    "Blissey": 35,
    "Bombirdier": 36,
    "Brambleghast": 37,
    "Braviary": 38,
    "Breloom": 39,
    "Bronzong": 40,
    "Brute Bonnet": 41,
    "Bruxish": 42,
    "Cacturne": 43,
    "Calyrex": 44,
    "Camerupt": 45,
    "Carbink": 46,
    "Ceruledge": 47,
    "Cetitan": 48,
    "Chandelure": 49,
    "Chansey": 50,
    "Charizard": 51,
    "Chesnaught": 52,
    "Chi": 53,
    "Chien": 54,
    "Chimecho": 55,
    "Cinccino": 56,
    "Cinderace": 57,
    "Clawitzer": 58,
    "Clefable": 59,
    "Clodsire": 60,
    "Cloyster": 61,
    "Coalossal": 62,
    "Cobalion": 63,
    "Comfey": 64,
    "Conkeldurr": 65,
    "Copperajah": 66,
    "Corviknight": 67,
    "Crabominable": 68,
    "Cramorant": 69,
    "Cramorant-Gorging": 70,
    "Cramorant-Gulping": 71,
    "Crawdaunt": 72,
    "Cresselia": 73,
    "Cryogonal": 74,
    "Cyclizar": 75,
    "Dachsbun": 76,
    "Darkrai": 77,
    "Decidueye": 78,
    "Dedenne": 79,
    "Delibird": 80,
    "Delphox": 81,
    "Deoxys": 82,
    "Dewgong": 83,
    "Dialga": 84,
    "Diancie": 85,
    "Dipplin": 86,
    "Ditto": 87,
    "Dodrio": 88,
    "Dondozo": 89,
    "Donphan": 90,
    "Dragalge": 91,
    "Dragapult": 92,
    "Dragonite": 93,
    "Drednaw": 94,
    "Drifblim": 95,
    "Dudunsparce": 96,
    "Dugtrio": 97,
    "Dunsparce": 98,
    "Duraludon": 99,
    "Dusknoir": 100,
    "Eelektross": 101,
    "Eiscue": 102,
    "Electivire": 103,
    "Electrode": 104,
    "Emboar": 105,
    "Empoleon": 106,
    "Enamorus": 107,
    "Entei": 108,
    "Espathra": 109,
    "Espeon": 110,
    "Eternatus": 111,
    "Excadrill": 112,
    "Exeggutor": 113,
    "Falinks": 114,
    "Farigiraf": 115,
    "Feraligatr": 116,
    "Fezandipiti": 117,
    "Flamigo": 118,
    "Flapple": 119,
    "Flareon": 120,
    "Floatzel": 121,
    "Florges": 122,
    "Flutter Mane": 123,
    "Flygon": 124,
    "Forretress": 125,
    "Froslass": 126,
    "Frosmoth": 127,
    "Furret": 128,
    "Gallade": 129,
    "Galvantula": 130,
    "Garchomp": 131,
    "Gardevoir": 132,
    "Garganacl": 133,
    "Gastrodon": 134,
    "Gengar": 135,
    "Gholdengo": 136,
    "Girafarig": 137,
    "Giratina": 138,
    "Glaceon": 139,
    "Glalie": 140,
    "Glastrier": 141,
    "Glimmora": 142,
    "Gliscor": 143,
    "Gogoat": 144,
    "Golduck": 145,
    "Golem": 146,
    "Golurk": 147,
    "Goodra": 148,
    "Gothitelle": 149,
    "Gouging Fire": 150,
    "Grafaiai": 151,
    "Granbull": 152,
    "Great Tusk": 153,
    "Greedent": 154,
    "Greninja": 155,
    "Grimmsnarl": 156,
    "Groudon": 157,
    "Grumpig": 158,
    "Gumshoos": 159,
    "Gurdurr": 160,
    "Gyarados": 161,
    "Hariyama": 162,
    "Hatterene": 163,
    "Hawlucha": 164,
    "Haxorus": 165,
    "Heatran": 166,
    "Heracross": 167,
    "Hippowdon": 168,
    "Hitmonchan": 169,
    "Hitmonlee": 170,
    "Hitmontop": 171,
    "Ho": 172,
    "Honchkrow": 173,
    "Hoopa": 174,
    "Houndoom": 175,
    "Houndstone": 176,
    "Hydrapple": 177,
    "Hydreigon": 178,
    "Hypno": 179,
    "Illumise": 180,
    "Incineroar": 181,
    "Indeedee": 182,
    "Infernape": 183,
    "Inteleon": 184,
    "Iron Boulder": 185,
    "Iron Bundle": 186,
    "Iron Crown": 187,
    "Iron Hands": 188,
    "Iron Jugulis": 189,
    "Iron Leaves": 190,
    "Iron Moth": 191,
    "Iron Thorns": 192,
    "Iron Treads": 193,
    "Iron Valiant": 194,
    "Jirachi": 195,
    "Jolteon": 196,
    "Jumpluff": 197,
    "Keldeo": 198,
    "Kilowattrel": 199,
    "Kingambit": 200,
    "Kingdra": 201,
    "Klawf": 202,
    "Kleavor": 203,
    "Klefki": 204,
    "Komala": 205,
    "Kommo": 206,
    "Koraidon": 207,
    "Kricketune": 208,
    "Krookodile": 209,
    "Kyogre": 210,
    "Kyurem": 211,
    "Landorus": 212,
    "Lanturn": 213,
    "Lapras": 214,
    "Latias": 215,
    "Latios": 216,
    "Leafeon": 217,
    "Leavanny": 218,
    "Lilligant": 219,
    "Lokix": 220,
    "Lucario": 221,
    "Ludicolo": 222,
    "Lugia": 223,
    "Lumineon": 224,
    "Lunala": 225,
    "Lurantis": 226,
    "Luvdisc": 227,
    "Luxray": 228,
    "Lycanroc": 229,
    "Mabosstiff": 230,
    "Magcargo": 231,
    "Magearna": 232,
    "Magmortar": 233,
    "Magnezone": 234,
    "Malamar": 235,
    "Mamoswine": 236,
    "Manaphy": 237,
    "Mandibuzz": 238,
    "Masquerain": 239,
    "Maushold": 240,
    "Medicham": 241,
    "Meganium": 242,
    "Meloetta": 243,
    "Meloetta-Pirouette": 244,
    "Meowscarada": 245,
    "Meowstic": 246,
    "Mesprit": 247,
    "Metagross": 248,
    "Mew": 249,
    "Mewtwo": 250,
    "Mienshao": 251,
    "Mightyena": 252,
    "Milotic": 253,
    "Mimikyu": 254,
    "Minior": 255,
    "Minior-Blue": 256,
    "Minior-Green": 257,
    "Minior-Indigo": 258,
    "Minior-Meteor": 259,
    "Minior-Orange": 260,
    "Minior-Violet": 261,
    "Minior-Yellow": 262,
    "Minun": 263,
    "Miraidon": 264,
    "Misdreavus": 265,
    "Mismagius": 266,
    "Moltres": 267,
    "Morpeko": 268,
    "Morpeko-Hangry": 269,
    "Mudsdale": 270,
    "Muk": 271,
    "Munkidori": 272,
    "Necrozma": 273,
    "Ninetales": 274,
    "Noctowl": 275,
    "Noivern": 276,
    "Ogerpon": 277,
    "Oinkologne": 278,
    "Okidogi": 279,
    "Oranguru": 280,
    "Oricorio": 281,
    "Orthworm": 282,
    "Overqwil": 283,
    "Pachirisu": 284,
    "Palafin": 285,
    "Palkia": 286,
    "Palossand": 287,
    "Passimian": 288,
    "Pawmot": 289,
    "Pecharunt": 290,
    "Pelipper": 291,
    "Perrserker": 292,
    "Persian": 293,
    "Phione": 294,
    "Pikachu": 295,
    "Piloswine": 296,
    "Pincurchin": 297,
    "Plusle": 298,
    "Politoed": 299,
    "Poliwrath": 300,
    "Polteageist": 301,
    "Porygon": 302,
    "Porygon2": 303,
    "Primarina": 304,
    "Probopass": 305,
    "Pyroar": 306,
    "Quagsire": 307,
    "Quaquaval": 308,
    "Qwilfish": 309,
    "Rabsca": 310,
    "Raging Bolt": 311,
    "Raichu": 312,
    "Raikou": 313,
    "Rampardos": 314,
    "Rayquaza": 315,
    "Regice": 316,
    "Regidrago": 317,
    "Regieleki": 318,
    "Regigigas": 319,
    "Regirock": 320,
    "Registeel": 321,
    "Reshiram": 322,
    "Reuniclus": 323,
    "Revavroom": 324,
    "Rhydon": 325,
    "Rhyperior": 326,
    "Ribombee": 327,
    "Rillaboom": 328,
    "Roaring Moon": 329,
    "Rotom": 330,
    "Sableye": 331,
    "Salamence": 332,
    "Salazzle": 333,
    "Samurott": 334,
    "Sandaconda": 335,
    "Sandslash": 336,
    "Sandy Shocks": 337,
    "Sawsbuck": 338,
    "Sceptile": 339,
    "Scizor": 340,
    "Scovillain": 341,
    "Scrafty": 342,
    "Scream Tail": 343,
    "Scyther": 344,
    "Serperior": 345,
    "Seviper": 346,
    "Shaymin": 347,
    "Shiftry": 348,
    "Sinistcha": 349,
    "Skarmory": 350,
    "Skeledirge": 351,
    "Skuntank": 352,
    "Slaking": 353,
    "Slither Wing": 354,
    "Slowbro": 355,
    "Slowking": 356,
    "Smeargle": 357,
    "Sneasler": 358,
    "Snorlax": 359,
    "Solgaleo": 360,
    "Spectrier": 361,
    "Spidops": 362,
    "Spiritomb": 363,
    "Squawkabilly": 364,
    "Staraptor": 365,
    "Stonjourner": 366,
    "Sudowoodo": 367,
    "Suicune": 368,
    "Sunflora": 369,
    "Swalot": 370,
    "Swampert": 371,
    "Swanna": 372,
    "Sylveon": 373,
    "Talonflame": 374,
    "Tatsugiri": 375,
    "Tauros": 376,
    "Tentacruel": 377,
    "Terapagos": 378,
    "Terrakion": 379,
    "Thundurus": 380,
    "Ting": 381,
    "Tinkaton": 382,
    "Toedscruel": 383,
    "Torkoal": 384,
    "Tornadus": 385,
    "Torterra": 386,
    "Toucannon": 387,
    "Toxapex": 388,
    "Toxicroak": 389,
    "Toxtricity": 390,
    "Trevenant": 391,
    "Tropius": 392,
    "Tsareena": 393,
    "Typhlosion": 394,
    "Tyranitar": 395,
    "Umbreon": 396,
    "Ursaluna": 397,
    "Ursaring": 398,
    "Urshifu": 399,
    "Uxie": 400,
    "Vaporeon": 401,
    "Veluza": 402,
    "Venomoth": 403,
    "Venusaur": 404,
    "Vespiquen": 405,
    "Victreebel": 406,
    "Vigoroth": 407,
    "Vikavolt": 408,
    "Vileplume": 409,
    "Virizion": 410,
    "Vivillon": 411,
    "Volbeat": 412,
    "Volcanion": 413,
    "Volcarona": 414,
    "Walking Wake": 415,
    "Weavile": 416,
    "Weezing": 417,
    "Whimsicott": 418,
    "Whiscash": 419,
    "Wigglytuff": 420,
    "Wo": 421,
    "Wugtrio": 422,
    "Wyrdeer": 423,
    "Yanmega": 424,
    "Zacian": 425,
    "Zamazenta": 426,
    "Zangoose": 427,
    "Zapdos": 428,
    "Zarude": 429,
    "Zebstrika": 430,
    "Zekrom": 431,
    "Zoroark": 432
  },
  "item": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<UNK_ITEM>": 2,
    "Air Balloon": 3,
    "Assault Vest": 4,
    "Chesto Berry": 5,
    "Choice Band": 6,
    "Choice Scarf": 7,
    "Choice Specs": 8,
    "Custap Berry": 9,
    "Draco Plate": 10,
    "Eviolite": 11,
    "Flame Orb": 12,
    "Focus Sash": 13,
    "Heavy-Duty Boots": 14,
    "Leftovers": 15,
    "Life Orb": 16,
    "Loaded Dice": 17,
    "Lum Berry": 18,
    "Lustrous Globe": 19,
    "Magnet": 20,
    "Mind Plate": 21,
    "Rocky Helmet": 22,
    "Rusted Shield": 23,
    "Silk Scarf": 24,
    "Sitrus Berry": 25,
    "Soul Dew": 26,
    "Spooky Plate": 27,
    "Toxic Orb": 28,
    "Weakness Policy": 29,
    "Wellspring Mask": 30,
    "White Herb": 31,
    "Wide Lens": 32
  },
  "ability": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<UNK_ABILITY>": 2,
    "Adaptability": 3,
    "Air Lock": 4,
    "Analytic": 5,
    "Anger Shell": 6,
    "Battle Bond": 7,
    "Beads of Ruin": 8,
    "Berserk": 9,
    "Blaze": 10,
    "Chilling Neigh": 11,
    "Chlorophyll": 12,
    "Clear Body": 13,
    "Cloud Nine": 14,
    "Comatose": 15,
    "Competitive": 16,
    "Contrary": 17,
    "Cursed Body": 18,
    "Dauntless Shield": 19,
    "Defiant": 20,
    "Download": 21,
    "Drizzle": 22,
    "Drought": 23,
    "Dry Skin": 24,
    "Embody Aspect (Cornerstone)": 25,
    "Embody Aspect (Hearthflame)": 26,
    "Embody Aspect (Teal)": 27,
    "Embody Aspect (Wellspring)": 28,
    "Flame Body": 29,
    "Flower Veil": 30,
    "Frisk": 31,
    "Fur Coat": 32,
    "Gooey": 33,
    "Grim Neigh": 34,
    "Harvest": 35,
    "Hustle": 36,
    "Ice Body": 37,
    "Infiltrator": 38,
    "Inner Focus": 39,
    "Insomnia": 40,
    "Intimidate": 41,
    "Intrepid Sword": 42,
    "Iron Fist": 43,
    "Justified": 44,
    "Leaf Guard": 45,
    "Levitate": 46,
    "Light Metal": 47,
    "Lightning Rod": 48,
    "Liquid Ooze": 49,
    "Magic Bounce": 50,
    "Magic Guard": 51,
    "Magician": 52,
    "Magnet Pull": 53,
    "Mirror Armor": 54,
    "Mold Breaker": 55,
    "Motor Drive": 56,
    "Moxie": 57,
    "Mycelium Might": 58,
    "Natural Cure": 59,
    "Overgrow": 60,
    "Poison Heal": 61,
    "Prankster": 62,
    "Pressure": 63,
    "Prism Armor": 64,
    "Protean": 65,
    "Punk Rock": 66,
    "Purifying Salt": 67,
    "Rattled": 68,
    "Regenerator": 69,
    "Sand Rush": 70,
    "Sand Stream": 71,
    "Sap Sipper": 72,
    "Sharpness": 73,
    "Shed Skin": 74,
    "Solid Rock": 75,
    "Soul-Heart": 76,
    "Speed Boost": 77,
    "Stakeout": 78,
    "Stamina": 79,
    "Storm Drain": 80,
    "Sturdy": 81,
    "Surge Surfer": 82,
    "Swarm": 83,
    "Swift Swim": 84,
    "Sword of Ruin": 85,
    "Tablets of Ruin": 86,
    "Tangling Hair": 87,
    "Technician": 88,
    "Teraform Zero": 89,
    "Teravolt": 90,
    "Thermal Exchange": 91,
    "Thick Fat": 92,
    "Tinted Lens": 93,
    "Transistor": 94,
    "Triage": 95,
    "Turboblaze": 96,
    "Unaware": 97,
    "Unburden": 98,
    "Unnerve": 99,
    "Vessel of Ruin": 100,
    "Volt Absorb": 101,
    "Water Absorb": 102,
    "Water Compaction": 103,
    "Water Veil": 104,
    "Weak Armor": 105,
    "Well-Baked Body": 106,
    "Wind Rider": 107
  },
  "tera": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<UNK_TERA>": 2,
    "Bug": 3,
    "Dark": 4,
    "Dragon": 5,
    "Electric": 6,
    "Fairy": 7,
    "Fighting": 8,
    "Fire": 9,
    "Flying": 10,
    "Ghost": 11,
    "Grass": 12,
    "Ground": 13,
    "Ice": 14,
    "Normal": 15,
    "Poison": 16,
    "Psychic": 17,
    "Rock": 18,
    "Steel": 19,
    "Stellar": 20,
    "Water": 21
  },
  "status": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<NONE_STATUS>": 2,
    "brn": 3,
    "frz": 4,
    "par": 5,
    "psn": 6,
    "slp": 7,
    "tox": 8
  },
  "move": {
    "<PAD>": 0,
    "<UNK>": 1,
    "accelerock": 2,
    "acidarmor": 3,
    "acrobatics": 4,
    "aeroblast": 5,
    "agility": 6,
    "airslash": 7,
    "alluringvoice": 8,
    "appleacid": 9,
    "aquacutter": 10,
    "aquajet": 11,
    "aquastep": 12,
    "armorcannon": 13,
    "astralbarrage": 14,
    "aurasphere": 15,
    "aurawheel": 16,
    "auroraveil": 17,
    "avalanche": 18,
    "beakblast": 19,
    "beatup": 20,
    "behemothblade": 21,
    "bellydrum": 22,
    "bite": 23,
    "bitterblade": 24,
    "bittermalice": 25,
    "bleakwindstorm": 26,
    "blizzard": 27,
    "bloodmoon": 28,
    "blueflare": 29,
    "bodypress": 30,
    "bodyslam": 31,
    "boltstrike": 32,
    "boomburst": 33,
    "bravebird": 34,
    "brickbreak": 35,
    "bugbite": 36,
    "bugbuzz": 37,
    "bulkup": 38,
    "bulletpunch": 39,
    "bulletseed": 40,
    "calmmind": 41,
    "ceaselessedge": 42,
    "chillyreception": 43,
    "circlethrow": 44,
    "clangingscales": 45,
    "clangoroussoul": 46,
    "clearsmog": 47,
    "closecombat": 48,
    "coil": 49,
    "collisioncourse": 50,
    "cosmicpower": 51,
    "courtchange": 52,
    "crabhammer": 53,
    "crunch": 54,
    "curse": 55,
    "darkpulse": 56,
    "dazzlinggleam": 57,
    "defog": 58,
    "destinybond": 59,
    "diamondstorm": 60,
    "direclaw": 61,
    "disable": 62,
    "discharge": 63,
    "double-edge": 64,
    "doubleshock": 65,
    "dracometeor": 66,
    "dragonascent": 67,
    "dragonclaw": 68,
    "dragondance": 69,
    "dragondarts": 70,
    "dragonenergy": 71,
    "dragonpulse": 72,
    "dragontail": 73,
    "drainingkiss": 74,
    "drainpunch": 75,
    "drillrun": 76,
    "dualwingbeat": 77,
    "dynamaxcannon": 78,
    "dynamicpunch": 79,
    "earthpower": 80,
    "earthquake": 81,
    "electrodrift": 82,
    "encore": 83,
    "endeavor": 84,
    "energyball": 85,
    "eruption": 86,
    "esperwing": 87,
    "expandingforce": 88,
    "explosion": 89,
    "extremespeed": 90,
    "facade": 91,
    "fakeout": 92,
    "ficklebeam": 93,
    "fierydance": 94,
    "fierywrath": 95,
    "filletaway": 96,
    "fireblast": 97,
    "firefang": 98,
    "firepunch": 99,
    "firstimpression": 100,
    "flamecharge": 101,
    "flamethrower": 102,
    "flareblitz": 103,
    "flashcannon": 104,
    "fleurcannon": 105,
    "flipturn": 106,
    "flowertrick": 107,
    "focusblast": 108,
    "focuspunch": 109,
    "foulplay": 110,
    "freeze-dry": 111,
    "freezingglare": 112,
    "fusionbolt": 113,
    "fusionflare": 114,
    "futuresight": 115,
    "gigadrain": 116,
    "gigaimpact": 117,
    "gigatonhammer": 118,
    "glaciallance": 119,
    "glaiverush": 120,
    "glare": 121,
    "grassknot": 122,
    "grassyglide": 123,
    "gravapple": 124,
    "gunkshot": 125,
    "haze": 126,
    "headbutt": 127,
    "headlongrush": 128,
    "headsmash": 129,
    "healbell": 130,
    "healingwish": 131,
    "heatcrash": 132,
    "heatwave": 133,
    "heavyslam": 134,
    "hex": 135,
    "highhorsepower": 136,
    "highjumpkick": 137,
    "hornleech": 138,
    "hurricane": 139,
    "hydropump": 140,
    "hydrosteam": 141,
    "hyperspacefury": 142,
    "hypervoice": 143,
    "hypnosis": 144,
    "icebeam": 145,
    "icefang": 146,
    "icehammer": 147,
    "icepunch": 148,
    "iceshard": 149,
    "icespinner": 150,
    "iciclecrash": 151,
    "iciclespear": 152,
    "irondefense": 153,
    "ironhead": 154,
    "irontail": 155,
    "ivycudgel": 156,
    "jetpunch": 157,
    "judgment": 158,
    "knockoff": 159,
    "kowtowcleave": 160,
    "lashout": 161,
    "lavaplume": 162,
    "leafblade": 163,
    "leafstorm": 164,
    "leechlife": 165,
    "leechseed": 166,
    "lightscreen": 167,
    "liquidation": 168,
    "lowkick": 169,
    "luminacrash": 170,
    "lunge": 171,
    "lusterpurge": 172,
    "machpunch": 173,
    "magmastorm": 174,
    "magnetrise": 175,
    "makeitrain": 176,
    "malignantchain": 177,
    "matchagotcha": 178,
    "megahorn": 179,
    "meteorbeam": 180,
    "meteormash": 181,
    "mightycleave": 182,
    "milkdrink": 183,
    "mirrorcoat": 184,
    "moonblast": 185,
    "moongeistbeam": 186,
    "moonlight": 187,
    "morningsun": 188,
    "mortalspin": 189,
    "muddywater": 190,
    "mudshot": 191,
    "mysticalfire": 192,
    "nastyplot": 193,
    "nightshade": 194,
    "nightslash": 195,
    "noretreat": 196,
    "nuzzle": 197,
    "originpulse": 198,
    "outrage": 199,
    "overdrive": 200,
    "overheat": 201,
    "painsplit": 202,
    "partingshot": 203,
    "payback": 204,
    "petalblizzard": 205,
    "petaldance": 206,
    "photongeyser": 207,
    "playrough": 208,
    "poisonfang": 209,
    "poisonjab": 210,
    "pollenpuff": 211,
    "poltergeist": 212,
    "populationbomb": 213,
    "pounce": 214,
    "powergem": 215,
    "powertrip": 216,
    "powerwhip": 217,
    "precipiceblades": 218,
    "protect": 219,
    "psyblade": 220,
    "psychic": 221,
    "psychicfangs": 222,
    "psychicnoise": 223,
    "psychoboost": 224,
    "psychocut": 225,
    "psyshock": 226,
    "psystrike": 227,
    "pyroball": 228,
    "quickattack": 229,
    "quiverdance": 230,
    "ragefist": 231,
    "ragingbull": 232,
    "raindance": 233,
    "rapidspin": 234,
    "razorshell": 235,
    "recover": 236,
    "reflect": 237,
    "relicsong": 238,
    "rest": 239,
    "revelationdance": 240,
    "revivalblessing": 241,
    "roar": 242,
    "rockblast": 243,
    "rockpolish": 244,
    "rockslide": 245,
    "rocktomb": 246,
    "roost": 247,
    "ruination": 248,
    "sacredfire": 249,
    "sacredsword": 250,
    "saltcure": 251,
    "scald": 252,
    "scaleshot": 253,
    "scorchingsands": 254,
    "secretsword": 255,
    "seedbomb": 256,
    "seedflare": 257,
    "seismictoss": 258,
    "shadowball": 259,
    "shadowclaw": 260,
    "shadowsneak": 261,
    "shedtail": 262,
    "shellsidearm": 263,
    "shellsmash": 264,
    "shiftgear": 265,
    "shoreup": 266,
    "slackoff": 267,
    "sleeppowder": 268,
    "sleeptalk": 269,
    "sludgebomb": 270,
    "sludgewave": 271,
    "snowscape": 272,
    "soft-boiled": 273,
    "solarbeam": 274,
    "spacialrend": 275,
    "sparklingaria": 276,
    "spikes": 277,
    "spiritbreak": 278,
    "spiritshackle": 279,
    "spore": 280,
    "stealthrock": 281,
    "steameruption": 282,
    "stickyweb": 283,
    "stompingtantrum": 284,
    "stoneaxe": 285,
    "stoneedge": 286,
    "storedpower": 287,
    "strangesteam": 288,
    "strengthsap": 289,
    "struggle": 290,
    "stunspore": 291,
    "substitute": 292,
    "suckerpunch": 293,
    "sunnyday": 294,
    "sunsteelstrike": 295,
    "supercellslam": 296,
    "superfang": 297,
    "superpower": 298,
    "surf": 299,
    "surgingstrikes": 300,
    "switcheroo": 301,
    "swordsdance": 302,
    "synthesis": 303,
    "tachyoncutter": 304,
    "tailglow": 305,
    "tailslap": 306,
    "tailwind": 307,
    "takeheart": 308,
    "taunt": 309,
    "teleport": 310,
    "temperflare": 311,
    "terablast": 312,
    "terastarstorm": 313,
    "throatchop": 314,
    "thunder": 315,
    "thunderbolt": 316,
    "thunderclap": 317,
    "thunderpunch": 318,
    "thunderwave": 319,
    "tidyup": 320,
    "torchsong": 321,
    "toxic": 322,
    "toxicspikes": 323,
    "trailblaze": 324,
    "triattack": 325,
    "trick": 326,
    "trickroom": 327,
    "triplearrows": 328,
    "tripleaxel": 329,
    "u-turn": 330,
    "vacuumwave": 331,
    "victorydance": 332,
    "voltswitch": 333,
    "volttackle": 334,
    "waterfall": 335,
    "waterpulse": 336,
    "waterspout": 337,
    "wavecrash": 338,
    "weatherball": 339,
    "whirlpool": 340,
    "whirlwind": 341,
    "wickedblow": 342,
    "wildcharge": 343,
    "will-o-wisp": 344,
    "wish": 345,
    "woodhammer": 346,
    "workup": 347,
    "x-scissor": 348,
    "yawn": 349,
    "zenheadbutt": 350,
    "zingzap": 351
  },
  "weather": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<NONE_WEATHER>": 2,
    "raindance": 3,
    "sandstorm": 4,
    "snowscape": 5,
    "sunnyday": 6
  },
  "global_condition": {
    "<PAD>": 0,
    "<UNK>": 1,
    "electricterrain": 2,
    "grassyterrain": 3,
    "psychicterrain": 4,
    "trickroom": 5
  }
}