{"<UNK>": 0, "knockoff": 1, "earthquake": 2, "calmmind": 3, "closecombat": 4, "thunderbolt": 5, "protect": 6, "u-turn": 7, "recover": 8, "swordsdance": 9, "thunderwave": 10, "shadowball": 11, "bodypress": 12, "substitute": 13, "scald": 14, "bodyslam": 15, "bravebird": 16, "roost": 17, "moonblast": 18, "icebeam": 19, "wish": 20, "ironhead": 21, "dragondance": 22, "hurricane": 23, "hydropump": 24, "stealthrock": 25, "fireblast": 26, "nastyplot": 27, "psyshock": 28, "playrough": 29, "stoneedge": 30, "gunkshot": 31, "gigadrain": 32, "psychicnoise": 33, "quiverdance": 34, "drainpunch": 35, "leechseed": 36, "sludgebomb": 37, "encore": 38, "poltergeist": 39, "darkpulse": 40, "earthpower": 41, "bulkup": 42, "toxic": 43, "dracometeor": 44, "spikes": 45, "voltswitch": 46, "suckerpunch": 47, "liquidation": 48, "will-o-wisp": 49, "psychic": 50, "irondefense": 51, "hypervoice": 52, "strengthsap": 53, "rapidspin": 54, "freeze-dry": 55, "bugbuzz": 56, "dazzlinggleam": 57, "outrage": 58, "flipturn": 59, "surf": 60, "focusblast": 61, "double-edge": 62, "airslash": 63, "stickyweb": 64, "terablast": 65, "flareblitz": 66, "seismictoss": 67, "rest": 68, "alluringvoice": 69, "foulplay": 70, "sleeptalk": 71, "drainingkiss": 72, "crunch": 73, "sludgewave": 74, "wavecrash": 75, "heavyslam": 76, "shellsmash": 77, "sleeppowder": 78, "toxicspikes": 79, "tripleaxel": 80, "curse": 81, "flamethrower": 82, "facade": 83, "iciclecrash": 84, "discharge": 85, "leafblade": 86, "coil": 87, "flashcannon": 88, "dragontail": 89, "shadowsneak": 90, "superpower": 91, "powerwhip": 92, "acrobatics": 93, "trailblaze": 94, "cosmicpower": 95, "spore": 96, "poisonjab": 97, "leafstorm": 98, "slackoff": 99, "taunt": 100, "throatchop": 101, "iceshard": 102, "moonlight": 103, "storedpower": 104, "dragonpulse": 105, "energyball": 106, "hornleech": 107, "highhorsepower": 108, "fakeout": 109, "scaleshot": 110, "icepunch": 111, "boomburst": 112, "saltcure": 113, "heatcrash": 114, "haze": 115, "synthesis": 116, "overheat": 117, "judgment": 118, "aquajet": 119, "partingshot": 120, "sacredfire": 121, "waterfall": 122, "machpunch": 123, "revelationdance": 124, "extremespeed": 125, "mysticalfire": 126, "icespinner": 127, "psychicfangs": 128, "superfang": 129, "lavaplume": 130, "trick": 131, "aeroblast": 132, "roar": 133, "yawn": 134, "populationbomb": 135, "nuzzle": 136, "supercellslam": 137, "megahorn": 138, "bulletpunch": 139, "tidyup": 140, "woodhammer": 141, "glare": 142, "triattack": 143, "painsplit": 144, "headsmash": 145, "highjumpkick": 146, "ivycudgel": 147, "dualwingbeat": 148, "weatherball": 149, "wildcharge": 150, "morningsun": 151, "bulletseed": 152, "defog": 153, "iciclespear": 154, "leechlife": 155, "stompingtantrum": 156, "soft-boiled": 157, "thunder": 158, "aurasphere": 159, "blizzard": 160, "rockslide": 161, "takeheart": 162, "grassknot": 163, "seedflare": 164, "powergem": 165, "acidarmor": 166, "lunge": 167, "aurawheel": 168, "bleakwindstorm": 169, "moongeistbeam": 170, "shiftgear": 171, "spiritbreak": 172, "zenheadbutt": 173, "auroraveil": 174, "appleacid": 175, "headbutt": 176, "agility": 177, "psychocut": 178, "torchsong": 179, "sunsteelstrike": 180, "whirlwind": 181, "ceaselessedge": 182, "ficklebeam": 183, "flamecharge": 184, "sacredsword": 185, "malignantchain": 186, "meteorbeam": 187, "bellydrum": 188, "secretsword": 189, "muddywater": 190, "quickattack": 191, "rockblast": 192, "bitterblade": 193, "matchagotcha": 194, "rockpolish": 195, "fierydance": 196, "stunspore": 197, "sparklingaria": 198, "sunnyday": 199, "diamondstorm": 200, "heatwave": 201, "jetpunch": 202, "dynamaxcannon": 203, "firstimpression": 204, "freezingglare": 205, "psystrike": 206, "seedbomb": 207, "steameruption": 208, "futuresight": 209, "lowkick": 210, "hypnosis": 211, "scorchingsands": 212, "tailslap": 213, "headlongrush": 214, "endeavor": 215, "milkdrink": 216, "shedtail": 217, "pyroball": 218, "solarbeam": 219, "terastarstorm": 220, "revivalblessing": 221, "waterspout": 222, "aquastep": 223, "avalanche": 224, "boltstrike": 225, "stoneaxe": 226, "electrodrift": 227, "zingzap": 228, "gigatonhammer": 229, "psychoboost": 230, "raindance": 231, "originpulse": 232, "waterpulse": 233, "nightshade": 234, "shellsidearm": 235, "beakblast": 236, "ruination": 237, "tailglow": 238, "thunderclap": 239, "eruption": 240, "precipiceblades": 241, "vacuumwave": 242, "whirlpool": 243, "circlethrow": 244, "crabhammer": 245, "fleurcannon": 246, "grassyglide": 247, "gravapple": 248, "pounce": 249, "spacialrend": 250, "nightslash": 251, "ragefist": 252, "fierywrath": 253, "dragondarts": 254, "lashout": 255, "luminacrash": 256, "tachyoncutter": 257, "gigaimpact": 258, "drillrun": 259, "kowtowcleave": 260, "reflect": 261, "flowertrick": 262, "mudshot": 263, "trickroom": 264, "mightycleave": 265, "noretreat": 266, "photongeyser": 267, "strangesteam": 268, "struggle": 269, "dragonascent": 270, "triplearrows": 271, "aquacutter": 272, "icehammer": 273, "armorcannon": 274, "esperwing": 275, "doubleshock": 276, "overdrive": 277, "surgingstrikes": 278, "hex": 279, "victorydance": 280, "firepunch": 281, "lightscreen": 282, "psyblade": 283, "x-scissor": 284, "direclaw": 285, "magmastorm": 286, "meteormash": 287, "bloodmoon": 288, "makeitrain": 289, "expandingforce": 290, "volttackle": 291, "bite": 292, "hyperspacefury": 293, "lusterpurge": 294, "shadowclaw": 295, "wickedblow": 296, "blueflare": 297, "astralbarrage": 298, "dragonenergy": 299, "explosion": 300, "dynamicpunch": 301, "hydrosteam": 302, "behemothblade": 303, "beatup": 304, "healbell": 305, "shoreup": 306, "focuspunch": 307, "petalblizzard": 308, "poisonfang": 309, "glaciallance": 310, "relicsong": 311, "brickbreak": 312, "clangingscales": 313, "dragonclaw": 314, "thunderpunch": 315, "destinybond": 316, "rocktomb": 317, "snowscape": 318, "accelerock": 319, "bugbite": 320, "powertrip": 321, "irontail": 322, "payback": 323, "ragingbull": 324, "glaiverush": 325, "clangoroussoul": 326, "spiritshackle": 327, "workup": 328, "chillyreception": 329, "tailwind": 330, "bittermalice": 331, "magnetrise": 332, "razorshell": 333, "icefang": 334, "pollenpuff": 335, "clearsmog": 336, "disable": 337, "filletaway": 338, "temperflare": 339, "switcheroo": 340, "fusionflare": 341, "mirrorcoat": 342, "petaldance": 343, "fusionbolt": 344, "collisioncourse": 345, "teleport": 346, "mortalspin": 347, "courtchange": 348, "firefang": 349, "healingwish": 350}