{
  "<NONE>": 0,
  "<UNK>": 1,
  "switch:2": 2,
  "move:bravebird": 3,
  "switch:3": 4,
  "move:double-edge": 5,
  "switch:4": 6,
  "move:gunkshot": 7,
  "move:thunderwave": 8,
  "move:lowkick": 9,
  "move:heavyslam": 10,
  "switch:5": 11,
  "move:closecombat": 12,
  "switch:6": 13,
  "move:glare": 14,
  "move:moonblast": 15,
  "move:terablast": 16,
  "switch:1": 17,
  "move:earthquake": 18,
  "move:bulkup": 19,
  "move:coil": 20,
  "move:drainpunch": 21,
  "move:nastyplot": 22,
  "move:swordsdance": 23,
  "move:knockoff": 24,
  "move:iciclecrash": 25,
  "move:aquajet": 26,
  "move:bodypress": 27,
  "move:stealthrock": 28,
  "move:lavaplume": 29,
  "move:weatherball": 30,
  "move:sleeppowder": 31,
  "move:victorydance": 32,
  "move:leafblade": 33,
  "move:machpunch": 34,
  "move:highjumpkick": 35,
  "move:playrough": 36,
  "move:psychic": 37,
  "move:stickyweb": 38,
  "move:bugbuzz": 39,
  "move:shadowball": 40,
  "move:superfang": 41,
  "move:makeitrain": 42,
  "move:recover": 43,
  "move:encore": 44,
  "move:u-turn": 45,
  "move:trailblaze": 46,
  "move:psyshock": 47,
  "move:hydropump": 48,
  "move:kowtowcleave": 49,
  "move:suckerpunch": 50,
  "move:shellsmash": 51,
  "move:icebeam": 52,
  "move:spore": 53,
  "move:icepunch": 54,
  "move:shadowsneak": 55,
  "move:trick": 56,
  "move:calmmind": 57,
  "move:fireblast": 58,
  "move:toxicspikes": 59,
  "move:freeze-dry": 60,
  "move:mudshot": 61,
  "move:ironhead": 62,
  "move:wish": 63,
  "move:noretreat": 64,
  "move:airslash": 65,
  "move:flowertrick": 66,
  "move:boomburst": 67,
  "move:facade": 68,
  "move:thunderbolt": 69,
  "move:heatcrash": 70,
  "move:hurricane": 71,
  "move:iciclespear": 72,
  "move:rockblast": 73,
  "move:wavecrash": 74,
  "move:yawn": 75,
  "move:brickbreak": 76,
  "move:roost": 77,
  "move:surf": 78,
  "move:dragonpulse": 79,
  "move:sacredfire": 80,
  "move:bleakwindstorm": 81,
  "move:relicsong": 82,
  "move:torchsong": 83,
  "move:appleacid": 84,
  "move:focusblast": 85,
  "move:drainingkiss": 86,
  "move:icespinner": 87,
  "move:gigadrain": 88,
  "move:lashout": 89,
  "move:partingshot": 90,
  "move:curse": 91,
  "move:slackoff": 92,
  "move:accelerock": 93,
  "move:rockpolish": 94,
  "move:stoneedge": 95,
  "move:whirlwind": 96,
  "move:heatwave": 97,
  "move:hornleech": 98,
  "move:ivycudgel": 99,
  "move:superpower": 100,
  "move:wickedblow": 101,
  "move:scald": 102,
  "move:discharge": 103,
  "move:dracometeor": 104,
  "move:flareblitz": 105,
  "move:substitute": 106,
  "move:hypervoice": 107,
  "move:darkpulse": 108,
  "move:sparklingaria": 109,
  "move:poltergeist": 110,
  "move:rest": 111,
  "move:quiverdance": 112,
  "move:astralbarrage": 113,
  "move:dazzlinggleam": 114,
  "move:sleeptalk": 115,
  "move:protect": 116,
  "move:drillrun": 117,
  "move:rapidspin": 118,
  "move:voltswitch": 119,
  "move:pollenpuff": 120,
  "move:irondefense": 121,
  "move:ruination": 122,
  "move:leechseed": 123,
  "move:mysticalfire": 124,
  "move:nuzzle": 125,
  "move:will-o-wisp": 126,
  "move:psychicnoise": 127,
  "move:flipturn": 128,
  "move:waterfall": 129,
  "move:waterspout": 130,
  "move:foulplay": 131,
  "move:spikes": 132,
  "move:tripleaxel": 133,
  "move:dragondance": 134,
  "move:outrage": 135,
  "move:wildcharge": 136,
  "move:revivalblessing": 137,
  "move:doubleshock": 138,
  "move:aurawheel": 139,
  "move:throatchop": 140,
  "move:crunch": 141,
  "move:bodyslam": 142,
  "move:fakeout": 143,
  "move:rockslide": 144,
  "move:avalanche": 145,
  "move:earthpower": 146,
  "move:cosmicpower": 147,
  "move:storedpower": 148,
  "move:futuresight": 149,
  "move:dragontail": 150,
  "move:terastarstorm": 151,
  "move:sludgewave": 152,
  "move:toxic": 153,
  "move:energyball": 154,
  "move:taunt": 155,
  "move:aeroblast": 156,
  "move:gigaimpact": 157,
  "move:diamondstorm": 158,
  "move:circlethrow": 159,
  "move:grassknot": 160,
  "move:highhorsepower": 161,
  "move:flamethrower": 162,
  "move:strengthsap": 163,
  "move:synthesis": 164,
  "move:shiftgear": 165,
  "move:flashcannon": 166,
  "move:fleurcannon": 167,
  "move:liquidation": 168,
  "move:raindance": 169,
  "move:leafstorm": 170,
  "move:eruption": 171,
  "move:meteormash": 172,
  "move:iceshard": 173,
  "move:bulletpunch": 174,
  "move:shellsidearm": 175,
  "move:waterpulse": 176,
  "move:poisonfang": 177,
  "move:moongeistbeam": 178,
  "move:moonlight": 179,
  "move:headlongrush": 180,
  "move:steameruption": 181,
  "move:flamecharge": 182,
  "move:populationbomb": 183,
  "move:morningsun": 184,
  "move:supercellslam": 185,
  "move:saltcure": 186,
  "move:scaleshot": 187,
  "move:dragonascent": 188,
  "move:defog": 189,
  "move:pounce": 190,
  "move:whirlpool": 191,
  "move:poisonjab": 192,
  "move:sacredsword": 193,
  "move:nightslash": 194,
  "move:bellydrum": 195,
  "move:destinybond": 196,
  "move:mightycleave": 197,
  "move:zenheadbutt": 198,
  "move:tidyup": 199,
  "move:extremespeed": 200,
  "move:acidarmor": 201,
  "move:thunder": 202,
  "move:powergem": 203,
  "move:alluringvoice": 204,
  "move:firstimpression": 205,
  "move:seedflare": 206,
  "move:agility": 207,
  "move:bittermalice": 208,
  "move:aquastep": 209,
  "move:roar": 210,
  "move:sludgebomb": 211,
  "move:haze": 212,
  "move:overheat": 213,
  "move:powertrip": 214,
  "move:zingzap": 215,
  "move:gigatonhammer": 216,
  "move:stompingtantrum": 217,
  "move:bulletseed": 218,
  "move:acrobatics": 219,
  "move:snowscape": 220,
  "move:expandingforce": 221,
  "move:sunsteelstrike": 222,
  "move:ragefist": 223,
  "move:revelationdance": 224,
  "move:hyperspacefury": 225,
  "move:grassyglide": 226,
  "move:painsplit": 227,
  "move:judgment": 228,
  "move:malignantchain": 229,
  "move:vacuumwave": 230,
  "move:bite": 231,
  "move:esperwing": 232,
  "move:seismictoss": 233,
  "move:psychoboost": 234,
  "move:headsmash": 235,
  "move:healbell": 236,
  "move:endeavor": 237,
  "move:meteorbeam": 238,
  "move:psychicfangs": 239,
  "move:soft-boiled": 240,
  "move:magnetrise": 241,
  "move:bloodmoon": 242,
  "move:lunge": 243,
  "move:aquacutter": 244,
  "move:volttackle": 245,
  "move:ragingbull": 246,
  "move:petalblizzard": 247,
  "move:tailglow": 248,
  "move:tachyoncutter": 249,
  "move:beatup": 250,
  "move:hydrosteam": 251,
  "move:fierywrath": 252,
  "move:woodhammer": 253,
  "move:ceaselessedge": 254,
  "move:dualwingbeat": 255,
  "move:boltstrike": 256,
  "move:strangesteam": 257,
  "move:glaiverush": 258,
  "move:aurasphere": 259,
  "move:scorchingsands": 260,
  "move:psyblade": 261,
  "move:electrodrift": 262,
  "move:dragondarts": 263,
  "move:workup": 264,
  "move:leechlife": 265,
  "move:muddywater": 266,
  "move:dynamicpunch": 267,
  "move:powerwhip": 268,
  "move:stunspore": 269,
  "move:hex": 270,
  "move:nightshade": 271,
  "move:megahorn": 272,
  "move:psystrike": 273,
  "move:triattack": 274,
  "move:jetpunch": 275,
  "move:shadowclaw": 276,
  "move:firepunch": 277,
  "move:tailslap": 278,
  "move:blizzard": 279,
  "move:spiritbreak": 280,
  "move:quickattack": 281,
  "move:tailwind": 282,
  "move:photongeyser": 283,
  "move:trickroom": 284,
  "move:glaciallance": 285,
  "move:takeheart": 286,
  "move:lightscreen": 287,
  "move:fierydance": 288,
  "move:armorcannon": 289,
  "move:solarbeam": 290,
  "move:icehammer": 291,
  "move:overdrive": 292,
  "move:bitterblade": 293,
  "move:gravapple": 294,
  "move:secretsword": 295,
  "move:matchagotcha": 296,
  "move:sunnyday": 297,
  "move:behemothblade": 298,
  "move:struggle": 299,
  "move:shedtail": 300,
  "move:ficklebeam": 301,
  "move:seedbomb": 302,
  "move:reflect": 303,
  "move:thunderclap": 304,
  "move:beakblast": 305,
  "move:magmastorm": 306,
  "move:milkdrink": 307,
  "move:auroraveil": 308,
  "move:headbutt": 309,
  "move:thunderpunch": 310,
  "move:pyroball": 311,
  "move:firefang": 312,
  "move:dynamaxcannon": 313,
  "move:lusterpurge": 314,
  "move:chillyreception": 315,
  "move:crabhammer": 316,
  "move:x-scissor": 317,
  "move:bugbite": 318,
  "move:direclaw": 319,
  "move:precipiceblades": 320,
  "move:switcheroo": 321,
  "move:psychocut": 322,
  "move:spacialrend": 323,
  "move:clangoroussoul": 324,
  "move:clangingscales": 325,
  "move:shoreup": 326,
  "move:triplearrows": 327,
  "move:focuspunch": 328,
  "move:luminacrash": 329,
  "move:blueflare": 330,
  "move:hypnosis": 331,
  "move:stoneaxe": 332,
  "move:originpulse": 333,
  "move:mortalspin": 334,
  "move:irontail": 335,
  "move:dragonenergy": 336,
  "move:explosion": 337,
  "move:freezingglare": 338,
  "move:spiritshackle": 339,
  "move:courtchange": 340,
  "move:rocktomb": 341,
  "move:clearsmog": 342,
  "move:payback": 343,
  "move:petaldance": 344,
  "move:mirrorcoat": 345,
  "move:temperflare": 346,
  "move:dragonclaw": 347,
  "move:filletaway": 348,
  "move:fusionbolt": 349,
  "move:icefang": 350,
  "move:disable": 351,
  "move:surgingstrikes": 352,
  "move:healingwish": 353,
  "move:teleport": 354,
  "move:fusionflare": 355,
  "move:razorshell": 356,
  "move:collisioncourse": 357
}