{
  "<UNK>": 0,
  "knockoff": 1,
  "earthquake": 2,
  "calmmind": 3,
  "closecombat": 4,
  "thunderbolt": 5,
  "protect": 6,
  "u-turn": 7,
  "recover": 8,
  "swordsdance": 9,
  "thunderwave": 10,
  "shadowball": 11,
  "bodypress": 12,
  "scald": 13,
  "bodyslam": 14,
  "substitute": 15,
  "bravebird": 16,
  "roost": 17,
  "moonblast": 18,
  "icebeam": 19,
  "wish": 20,
  "dragondance": 21,
  "ironhead": 22,
  "hydropump": 23,
  "hurricane": 24,
  "stealthrock": 25,
  "fireblast": 26,
  "nastyplot": 27,
  "psyshock": 28,
  "stoneedge": 29,
  "gunkshot": 30,
  "gigadrain": 31,
  "playrough": 32,
  "psychicnoise": 33,
  "sludgebomb": 34,
  "quiverdance": 35,
  "drainpunch": 36,
  "encore": 37,
  "darkpulse": 38,
  "leechseed": 39,
  "toxic": 40,
  "poltergeist": 41,
  "bulkup": 42,
  "earthpower": 43,
  "spikes": 44,
  "dracometeor": 45,
  "suckerpunch": 46,
  "liquidation": 47,
  "voltswitch": 48,
  "irondefense": 49,
  "will-o-wisp": 50,
  "psychic": 51,
  "rapidspin": 52,
  "freeze-dry": 53,
  "strengthsap": 54,
  "hypervoice": 55,
  "bugbuzz": 56,
  "outrage": 57,
  "dazzlinggleam": 58,
  "flipturn": 59,
  "focusblast": 60,
  "surf": 61,
  "double-edge": 62,
  "terablast": 63,
  "stickyweb": 64,
  "airslash": 65,
  "flareblitz": 66,
  "alluringvoice": 67,
  "foulplay": 68,
  "seismictoss": 69,
  "rest": 70,
  "sleeptalk": 71,
  "drainingkiss": 72,
  "wavecrash": 73,
  "shellsmash": 74,
  "crunch": 75,
  "sleeppowder": 76,
  "sludgewave": 77,
  "curse": 78,
  "toxicspikes": 79,
  "tripleaxel": 80,
  "heavyslam": 81,
  "iciclecrash": 82,
  "flamethrower": 83,
  "facade": 84,
  "discharge": 85,
  "leafblade": 86,
  "flashcannon": 87,
  "coil": 88,
  "dragontail": 89,
  "shadowsneak": 90,
  "acrobatics": 91,
  "superpower": 92,
  "cosmicpower": 93,
  "trailblaze": 94,
  "powerwhip": 95,
  "slackoff": 96,
  "leafstorm": 97,
  "iceshard": 98,
  "throatchop": 99,
  "poisonjab": 100,
  "taunt": 101,
  "dragonpulse": 102,
  "moonlight": 103,
  "storedpower": 104,
  "spore": 105,
  "highhorsepower": 106,
  "energyball": 107,
  "synthesis": 108,
  "scaleshot": 109,
  "fakeout": 110,
  "icepunch": 111,
  "boomburst": 112,
  "hornleech": 113,
  "saltcure": 114,
  "overheat": 115,
  "judgment": 116,
  "aquajet": 117,
  "heatcrash": 118,
  "partingshot": 119,
  "haze": 120,
  "superfang": 121,
  "sacredfire": 122,
  "machpunch": 123,
  "waterfall": 124,
  "mysticalfire": 125,
  "icespinner": 126,
  "trick": 127,
  "populationbomb": 128,
  "revelationdance": 129,
  "yawn": 130,
  "lavaplume": 131,
  "nuzzle": 132,
  "aeroblast": 133,
  "megahorn": 134,
  "roar": 135,
  "glare": 136,
  "highjumpkick": 137,
  "tidyup": 138,
  "psychicfangs": 139,
  "extremespeed": 140,
  "bulletpunch": 141,
  "woodhammer": 142,
  "ivycudgel": 143,
  "supercellslam": 144,
  "weatherball": 145,
  "headsmash": 146,
  "wildcharge": 147,
  "dualwingbeat": 148,
  "iciclespear": 149,
  "bulletseed": 150,
  "leechlife": 151,
  "defog": 152,
  "morningsun": 153,
  "painsplit": 154,
  "aurasphere": 155,
  "stompingtantrum": 156,
  "soft-boiled": 157,
  "triattack": 158,
  "thunder": 159,
  "moongeistbeam": 160,
  "grassknot": 161,
  "blizzard": 162,
  "lunge": 163,
  "seedflare": 164,
  "powergem": 165,
  "rockslide": 166,
  "spiritbreak": 167,
  "takeheart": 168,
  "shiftgear": 169,
  "bleakwindstorm": 170,
  "headbutt": 171,
  "auroraveil": 172,
  "acidarmor": 173,
  "agility": 174,
  "aurawheel": 175,
  "zenheadbutt": 176,
  "malignantchain": 177,
  "muddywater": 178,
  "torchsong": 179,
  "bellydrum": 180,
  "quickattack": 181,
  "secretsword": 182,
  "psychocut": 183,
  "bitterblade": 184,
  "meteorbeam": 185,
  "ficklebeam": 186,
  "flamecharge": 187,
  "sacredsword": 188,
  "ceaselessedge": 189,
  "rockblast": 190,
  "whirlwind": 191,
  "sparklingaria": 192,
  "appleacid": 193,
  "rockpolish": 194,
  "fierydance": 195,
  "sunsteelstrike": 196,
  "diamondstorm": 197,
  "matchagotcha": 198,
  "dynamaxcannon": 199,
  "firstimpression": 200,
  "heatwave": 201,
  "jetpunch": 202,
  "sunnyday": 203,
  "originpulse": 204,
  "psystrike": 205,
  "scorchingsands": 206,
  "futuresight": 207,
  "steameruption": 208,
  "freezingglare": 209,
  "nightshade": 210,
  "waterspout": 211,
  "shedtail": 212,
  "pyroball": 213,
  "stunspore": 214,
  "zingzap": 215,
  "aquastep": 216,
  "hypnosis": 217,
  "milkdrink": 218,
  "gigatonhammer": 219,
  "solarbeam": 220,
  "tailslap": 221,
  "seedbomb": 222,
  "revivalblessing": 223,
  "shellsidearm": 224,
  "headlongrush": 225,
  "lowkick": 226,
  "terastarstorm": 227,
  "endeavor": 228,
  "precipiceblades": 229,
  "eruption": 230,
  "psychoboost": 231,
  "stoneaxe": 232,
  "beakblast": 233,
  "raindance": 234,
  "electrodrift": 235,
  "tailglow": 236,
  "boltstrike": 237,
  "ruination": 238,
  "crabhammer": 239,
  "avalanche": 240,
  "gravapple": 241,
  "thunderclap": 242,
  "vacuumwave": 243,
  "fierywrath": 244,
  "waterpulse": 245,
  "whirlpool": 246,
  "circlethrow": 247,
  "grassyglide": 248,
  "pounce": 249,
  "mudshot": 250,
  "nightslash": 251,
  "strangesteam": 252,
  "spacialrend": 253,
  "lashout": 254,
  "struggle": 255,
  "fleurcannon": 256,
  "gigaimpact": 257,
  "dragondarts": 258,
  "kowtowcleave": 259,
  "ragefist": 260,
  "drillrun": 261,
  "tachyoncutter": 262,
  "dragonascent": 263,
  "surgingstrikes": 264,
  "trickroom": 265,
  "icehammer": 266,
  "noretreat": 267,
  "aquacutter": 268,
  "flowertrick": 269,
  "esperwing": 270,
  "mightycleave": 271,
  "hex": 272,
  "luminacrash": 273,
  "reflect": 274,
  "makeitrain": 275,
  "victorydance": 276,
  "overdrive": 277,
  "armorcannon": 278,
  "direclaw": 279,
  "psyblade": 280,
  "expandingforce": 281,
  "firepunch": 282,
  "lusterpurge": 283,
  "photongeyser": 284,
  "x-scissor": 285,
  "volttackle": 286,
  "hyperspacefury": 287,
  "bite": 288,
  "doubleshock": 289,
  "lightscreen": 290,
  "meteormash": 291,
  "blueflare": 292,
  "triplearrows": 293,
  "bloodmoon": 294,
  "astralbarrage": 295,
  "shoreup": 296,
  "behemothblade": 297,
  "healbell": 298,
  "magmastorm": 299,
  "explosion": 300,
  "glaciallance": 301,
  "hydrosteam": 302,
  "shadowclaw": 303,
  "beatup": 304,
  "dynamicpunch": 305,
  "brickbreak": 306,
  "clangingscales": 307,
  "dragonclaw": 308,
  "wickedblow": 309,
  "dragonenergy": 310,
  "poisonfang": 311,
  "snowscape": 312,
  "irontail": 313,
  "powertrip": 314,
  "relicsong": 315,
  "destinybond": 316,
  "petalblizzard": 317,
  "rocktomb": 318,
  "thunderpunch": 319,
  "bugbite": 320,
  "accelerock": 321,
  "ragingbull": 322,
  "focuspunch": 323,
  "clangoroussoul": 324,
  "bittermalice": 325,
  "glaiverush": 326,
  "payback": 327,
  "tailwind": 328,
  "workup": 329,
  "chillyreception": 330,
  "magnetrise": 331,
  "razorshell": 332,
  "spiritshackle": 333,
  "icefang": 334,
  "clearsmog": 335,
  "filletaway": 336,
  "mirrorcoat": 337,
  "switcheroo": 338,
  "disable": 339,
  "teleport": 340,
  "temperflare": 341,
  "pollenpuff": 342,
  "collisioncourse": 343,
  "healingwish": 344,
  "petaldance": 345,
  "firefang": 346,
  "fusionflare": 347,
  "mortalspin": 348,
  "courtchange": 349,
  "fusionbolt": 350
}