{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<UNK>": 3,
  "boost:p1:accuracy:1": 4,
  "boost:p1:atk:1": 5,
  "boost:p1:atk:2": 6,
  "boost:p1:def:1": 7,
  "boost:p1:def:2": 8,
  "boost:p1:spa:1": 9,
  "boost:p1:spa:2": 10,
  "boost:p1:spa:3": 11,
  "boost:p1:spd:1": 12,
  "boost:p1:spd:2": 13,
  "boost:p1:spe:1": 14,
  "boost:p1:spe:2": 15,
  "boost:p2:accuracy:1": 16,
  "boost:p2:atk:1": 17,
  "boost:p2:atk:2": 18,
  "boost:p2:def:1": 19,
  "boost:p2:def:2": 20,
  "boost:p2:spa:1": 21,
  "boost:p2:spa:2": 22,
  "boost:p2:spa:3": 23,
  "boost:p2:spd:1": 24,
  "boost:p2:spd:2": 25,
  "boost:p2:spe:1": 26,
  "boost:p2:spe:2": 27,
  "damage:p1:hp_bin_-1": 28,
  "damage:p1:hp_bin_-10": 29,
  "damage:p1:hp_bin_-11": 30,
  "damage:p1:hp_bin_-12": 31,
  "damage:p1:hp_bin_-13": 32,
  "damage:p1:hp_bin_-14": 33,
  "damage:p1:hp_bin_-15": 34,
  "damage:p1:hp_bin_-16": 35,
  "damage:p1:hp_bin_-17": 36,
  "damage:p1:hp_bin_-18": 37,
  "damage:p1:hp_bin_-19": 38,
  "damage:p1:hp_bin_-2": 39,
  "damage:p1:hp_bin_-20": 40,
  "damage:p1:hp_bin_-3": 41,
  "damage:p1:hp_bin_-4": 42,
  "damage:p1:hp_bin_-5": 43,
  "damage:p1:hp_bin_-6": 44,
  "damage:p1:hp_bin_-7": 45,
  "damage:p1:hp_bin_-8": 46,
  "damage:p1:hp_bin_-9": 47,
  "damage:p1:hp_bin_0": 48,
  "damage:p1:hp_bin_1": 49,
  "damage:p1:hp_bin_10": 50,
  "damage:p1:hp_bin_11": 51,
  "damage:p1:hp_bin_12": 52,
  "damage:p1:hp_bin_13": 53,
  "damage:p1:hp_bin_14": 54,
  "damage:p1:hp_bin_15": 55,
  "damage:p1:hp_bin_16": 56,
  "damage:p1:hp_bin_17": 57,
  "damage:p1:hp_bin_18": 58,
  "damage:p1:hp_bin_19": 59,
  "damage:p1:hp_bin_2": 60,
  "damage:p1:hp_bin_20": 61,
  "damage:p1:hp_bin_3": 62,
  "damage:p1:hp_bin_4": 63,
  "damage:p1:hp_bin_5": 64,
  "damage:p1:hp_bin_6": 65,
  "damage:p1:hp_bin_7": 66,
  "damage:p1:hp_bin_8": 67,
  "damage:p1:hp_bin_9": 68,
  "damage:p2:hp_bin_-1": 69,
  "damage:p2:hp_bin_-10": 70,
  "damage:p2:hp_bin_-11": 71,
  "damage:p2:hp_bin_-12": 72,
  "damage:p2:hp_bin_-13": 73,
  "damage:p2:hp_bin_-14": 74,
  "damage:p2:hp_bin_-15": 75,
  "damage:p2:hp_bin_-16": 76,
  "damage:p2:hp_bin_-17": 77,
  "damage:p2:hp_bin_-18": 78,
  "damage:p2:hp_bin_-19": 79,
  "damage:p2:hp_bin_-2": 80,
  "damage:p2:hp_bin_-20": 81,
  "damage:p2:hp_bin_-3": 82,
  "damage:p2:hp_bin_-4": 83,
  "damage:p2:hp_bin_-5": 84,
  "damage:p2:hp_bin_-6": 85,
  "damage:p2:hp_bin_-7": 86,
  "damage:p2:hp_bin_-8": 87,
  "damage:p2:hp_bin_-9": 88,
  "damage:p2:hp_bin_0": 89,
  "damage:p2:hp_bin_1": 90,
  "damage:p2:hp_bin_10": 91,
  "damage:p2:hp_bin_11": 92,
  "damage:p2:hp_bin_12": 93,
  "damage:p2:hp_bin_13": 94,
  "damage:p2:hp_bin_14": 95,
  "damage:p2:hp_bin_15": 96,
  "damage:p2:hp_bin_16": 97,
  "damage:p2:hp_bin_17": 98,
  "damage:p2:hp_bin_18": 99,
  "damage:p2:hp_bin_19": 100,
  "damage:p2:hp_bin_2": 101,
  "damage:p2:hp_bin_20": 102,
  "damage:p2:hp_bin_3": 103,
  "damage:p2:hp_bin_4": 104,
  "damage:p2:hp_bin_5": 105,
  "damage:p2:hp_bin_6": 106,
  "damage:p2:hp_bin_7": 107,
  "damage:p2:hp_bin_8": 108,
  "damage:p2:hp_bin_9": 109,
  "faint:p1": 110,
  "faint:p2": 111,
  "field:electricterrain:end": 112,
  "field:electricterrain:start": 113,
  "field:grassyterrain:end": 114,
  "field:grassyterrain:start": 115,
  "field:psychicterrain:end": 116,
  "field:psychicterrain:start": 117,
  "field:trickroom:end": 118,
  "field:trickroom:start": 119,
  "forme_change:p1:species:Cramorant": 120,
  "forme_change:p1:species:Cramorant-Gorging": 121,
  "forme_change:p1:species:Cramorant-Gulping": 122,
  "forme_change:p1:species:Meloetta": 123,
  "forme_change:p1:species:Meloetta-Pirouette": 124,
  "forme_change:p1:species:Minior": 125,
  "forme_change:p1:species:Minior-Blue": 126,
  "forme_change:p1:species:Minior-Green": 127,
  "forme_change:p1:species:Minior-Indigo": 128,
  "forme_change:p1:species:Minior-Meteor": 129,
  "forme_change:p1:species:Minior-Orange": 130,
  "forme_change:p1:species:Minior-Violet": 131,
  "forme_change:p1:species:Minior-Yellow": 132,
  "forme_change:p1:species:Morpeko": 133,
  "forme_change:p1:species:Morpeko-Hangry": 134,
  "forme_change:p1:tera:Bug": 135,
  "forme_change:p1:tera:Dark": 136,
  "forme_change:p1:tera:Dragon": 137,
  "forme_change:p1:tera:Electric": 138,
  "forme_change:p1:tera:Fairy": 139,
  "forme_change:p1:tera:Fighting": 140,
  "forme_change:p1:tera:Fire": 141,
  "forme_change:p1:tera:Flying": 142,
  "forme_change:p1:tera:Ghost": 143,
  "forme_change:p1:tera:Grass": 144,
  "forme_change:p1:tera:Ground": 145,
  "forme_change:p1:tera:Ice": 146,
  "forme_change:p1:tera:Normal": 147,
  "forme_change:p1:tera:Poison": 148,
  "forme_change:p1:tera:Psychic": 149,
  "forme_change:p1:tera:Rock": 150,
  "forme_change:p1:tera:Steel": 151,
  "forme_change:p1:tera:Stellar": 152,
  "forme_change:p1:tera:Water": 153,
  "forme_change:p2:species:Cramorant": 154,
  "forme_change:p2:species:Cramorant-Gorging": 155,
  "forme_change:p2:species:Cramorant-Gulping": 156,
  "forme_change:p2:species:Meloetta": 157,
  "forme_change:p2:species:Meloetta-Pirouette": 158,
  "forme_change:p2:species:Minior": 159,
  "forme_change:p2:species:Minior-Blue": 160,
  "forme_change:p2:species:Minior-Green": 161,
  "forme_change:p2:species:Minior-Indigo": 162,
  "forme_change:p2:species:Minior-Meteor": 163,
  "forme_change:p2:species:Minior-Orange": 164,
  "forme_change:p2:species:Minior-Violet": 165,
  "forme_change:p2:species:Minior-Yellow": 166,
  "forme_change:p2:species:Morpeko": 167,
  "forme_change:p2:species:Morpeko-Hangry": 168,
  "forme_change:p2:tera:Bug": 169,
  "forme_change:p2:tera:Dark": 170,
  "forme_change:p2:tera:Dragon": 171,
  "forme_change:p2:tera:Electric": 172,
  "forme_change:p2:tera:Fairy": 173,
  "forme_change:p2:tera:Fighting": 174,
  "forme_change:p2:tera:Fire": 175,
  "forme_change:p2:tera:Flying": 176,
  "forme_change:p2:tera:Ghost": 177,
  "forme_change:p2:tera:Grass": 178,
  "forme_change:p2:tera:Ground": 179,
  "forme_change:p2:tera:Ice": 180,
  "forme_change:p2:tera:Normal": 181,
  "forme_change:p2:tera:Poison": 182,
  "forme_change:p2:tera:Psychic": 183,
  "forme_change:p2:tera:Rock": 184,
  "forme_change:p2:tera:Steel": 185,
  "forme_change:p2:tera:Stellar": 186,
  "forme_change:p2:tera:Water": 187,
  "heal:p1:hp_bin_0": 188,
  "heal:p1:hp_bin_1": 189,
  "heal:p1:hp_bin_10": 190,
  "heal:p1:hp_bin_11": 191,
  "heal:p1:hp_bin_12": 192,
  "heal:p1:hp_bin_13": 193,
  "heal:p1:hp_bin_14": 194,
  "heal:p1:hp_bin_15": 195,
  "heal:p1:hp_bin_16": 196,
  "heal:p1:hp_bin_17": 197,
  "heal:p1:hp_bin_18": 198,
  "heal:p1:hp_bin_19": 199,
  "heal:p1:hp_bin_2": 200,
  "heal:p1:hp_bin_20": 201,
  "heal:p1:hp_bin_3": 202,
  "heal:p1:hp_bin_4": 203,
  "heal:p1:hp_bin_5": 204,
  "heal:p1:hp_bin_6": 205,
  "heal:p1:hp_bin_7": 206,
  "heal:p1:hp_bin_8": 207,
  "heal:p1:hp_bin_9": 208,
  "heal:p2:hp_bin_0": 209,
  "heal:p2:hp_bin_1": 210,
  "heal:p2:hp_bin_10": 211,
  "heal:p2:hp_bin_11": 212,
  "heal:p2:hp_bin_12": 213,
  "heal:p2:hp_bin_13": 214,
  "heal:p2:hp_bin_14": 215,
  "heal:p2:hp_bin_15": 216,
  "heal:p2:hp_bin_16": 217,
  "heal:p2:hp_bin_17": 218,
  "heal:p2:hp_bin_18": 219,
  "heal:p2:hp_bin_19": 220,
  "heal:p2:hp_bin_2": 221,
  "heal:p2:hp_bin_20": 222,
  "heal:p2:hp_bin_3": 223,
  "heal:p2:hp_bin_4": 224,
  "heal:p2:hp_bin_5": 225,
  "heal:p2:hp_bin_6": 226,
  "heal:p2:hp_bin_7": 227,
  "heal:p2:hp_bin_8": 228,
  "heal:p2:hp_bin_9": 229,
  "move:p1:accelerock:p2": 230,
  "move:p1:acidarmor:p1": 231,
  "move:p1:acrobatics:p2": 232,
  "move:p1:aeroblast:p2": 233,
  "move:p1:agility:p1": 234,
  "move:p1:airslash:": 235,
  "move:p1:airslash:p2": 236,
  "move:p1:alluringvoice:": 237,
  "move:p1:alluringvoice:p2": 238,
  "move:p1:appleacid:p2": 239,
  "move:p1:aquacutter:p2": 240,
  "move:p1:aquajet:": 241,
  "move:p1:aquajet:p2": 242,
  "move:p1:aquastep:p2": 243,
  "move:p1:armorcannon:p2": 244,
  "move:p1:astralbarrage:p2": 245,
  "move:p1:aurasphere:p2": 246,
  "move:p1:aurawheel:": 247,
  "move:p1:aurawheel:p2": 248,
  "move:p1:auroraveil:": 249,
  "move:p1:auroraveil:p1": 250,
  "move:p1:avalanche:p2": 251,
  "move:p1:beakblast:p2": 252,
  "move:p1:beatup:p2": 253,
  "move:p1:behemothblade:p2": 254,
  "move:p1:bellydrum:": 255,
  "move:p1:bellydrum:p1": 256,
  "move:p1:bite:": 257,
  "move:p1:bite:p2": 258,
  "move:p1:bitterblade:p2": 259,
  "move:p1:bittermalice:p2": 260,
  "move:p1:bleakwindstorm:p2": 261,
  "move:p1:blizzard:p2": 262,
  "move:p1:bloodmoon:p2": 263,
  "move:p1:blueflare:": 264,
  "move:p1:blueflare:p2": 265,
  "move:p1:bodypress:": 266,
  "move:p1:bodypress:p2": 267,
  "move:p1:bodyslam:": 268,
  "move:p1:bodyslam:p2": 269,
  "move:p1:boltstrike:p2": 270,
  "move:p1:boomburst:p2": 271,
  "move:p1:bravebird:": 272,
  "move:p1:bravebird:p2": 273,
  "move:p1:brickbreak:p2": 274,
  "move:p1:bugbite:p2": 275,
  "move:p1:bugbuzz:": 276,
  "move:p1:bugbuzz:p2": 277,
  "move:p1:bulkup:p1": 278,
  "move:p1:bulletpunch:p2": 279,
  "move:p1:bulletseed:p2": 280,
  "move:p1:calmmind:p1": 281,
  "move:p1:ceaselessedge:p2": 282,
  "move:p1:chillyreception:p1": 283,
  "move:p1:circlethrow:": 284,
  "move:p1:circlethrow:p2": 285,
  "move:p1:clangingscales:p2": 286,
  "move:p1:clangoroussoul:p1": 287,
  "move:p1:clearsmog:p2": 288,
  "move:p1:closecombat:": 289,
  "move:p1:closecombat:p2": 290,
  "move:p1:coil:p1": 291,
  "move:p1:collisioncourse:p2": 292,
  "move:p1:cosmicpower:p1": 293,
  "move:p1:courtchange:p1": 294,
  "move:p1:crabhammer:p2": 295,
  "move:p1:crunch:": 296,
  "move:p1:crunch:p2": 297,
  "move:p1:curse:p1": 298,
  "move:p1:darkpulse:": 299,
  "move:p1:darkpulse:p2": 300,
  "move:p1:dazzlinggleam:": 301,
  "move:p1:dazzlinggleam:p2": 302,
  "move:p1:defog:": 303,
  "move:p1:defog:p2": 304,
  "move:p1:destinybond:": 305,
  "move:p1:destinybond:p1": 306,
  "move:p1:diamondstorm:p2": 307,
  "move:p1:direclaw:p2": 308,
  "move:p1:disable:": 309,
  "move:p1:disable:p2": 310,
  "move:p1:discharge:p2": 311,
  "move:p1:double-edge:p2": 312,
  "move:p1:doubleshock:": 313,
  "move:p1:doubleshock:p2": 314,
  "move:p1:dracometeor:": 315,
  "move:p1:dracometeor:p2": 316,
  "move:p1:dragonascent:p2": 317,
  "move:p1:dragonclaw:p2": 318,
  "move:p1:dragondance:p1": 319,
  "move:p1:dragondarts:p2": 320,
  "move:p1:dragonenergy:p2": 321,
  "move:p1:dragonpulse:": 322,
  "move:p1:dragonpulse:p2": 323,
  "move:p1:dragontail:": 324,
  "move:p1:dragontail:p2": 325,
  "move:p1:drainingkiss:p2": 326,
  "move:p1:drainpunch:p2": 327,
  "move:p1:drillrun:p2": 328,
  "move:p1:dualwingbeat:p2": 329,
  "move:p1:dynamaxcannon:p2": 330,
  "move:p1:dynamicpunch:": 331,
  "move:p1:dynamicpunch:p2": 332,
  "move:p1:earthpower:": 333,
  "move:p1:earthpower:p2": 334,
  "move:p1:earthquake:": 335,
  "move:p1:earthquake:p2": 336,
  "move:p1:electrodrift:p2": 337,
  "move:p1:encore:": 338,
  "move:p1:encore:p2": 339,
  "move:p1:endeavor:p2": 340,
  "move:p1:energyball:": 341,
  "move:p1:energyball:p2": 342,
  "move:p1:eruption:p2": 343,
  "move:p1:esperwing:p2": 344,
  "move:p1:expandingforce:p2": 345,
  "move:p1:explosion:p2": 346,
  "move:p1:extremespeed:p2": 347,
  "move:p1:facade:": 348,
  "move:p1:facade:p2": 349,
  "move:p1:fakeout:": 350,
  "move:p1:fakeout:p2": 351,
  "move:p1:ficklebeam:p2": 352,
  "move:p1:fierydance:p2": 353,
  "move:p1:fierywrath:": 354,
  "move:p1:fierywrath:p2": 355,
  "move:p1:filletaway:p1": 356,
  "move:p1:fireblast:": 357,
  "move:p1:fireblast:p2": 358,
  "move:p1:firefang:p2": 359,
  "move:p1:firepunch:p2": 360,
  "move:p1:firstimpression:p2": 361,
  "move:p1:flamecharge:p2": 362,
  "move:p1:flamethrower:p2": 363,
  "move:p1:flareblitz:": 364,
  "move:p1:flareblitz:p2": 365,
  "move:p1:flashcannon:": 366,
  "move:p1:flashcannon:p2": 367,
  "move:p1:fleurcannon:p2": 368,
  "move:p1:flipturn:": 369,
  "move:p1:flipturn:p2": 370,
  "move:p1:flowertrick:p2": 371,
  "move:p1:focusblast:": 372,
  "move:p1:focusblast:p2": 373,
  "move:p1:focuspunch:p2": 374,
  "move:p1:foulplay:p2": 375,
  "move:p1:freeze-dry:p2": 376,
  "move:p1:freezingglare:p2": 377,
  "move:p1:fusionbolt:p2": 378,
  "move:p1:fusionflare:p2": 379,
  "move:p1:futuresight:p2": 380,
  "move:p1:gigadrain:": 381,
  "move:p1:gigadrain:p2": 382,
  "move:p1:gigaimpact:p2": 383,
  "move:p1:gigatonhammer:p2": 384,
  "move:p1:glaciallance:p2": 385,
  "move:p1:glaiverush:p2": 386,
  "move:p1:glare:": 387,
  "move:p1:glare:p2": 388,
  "move:p1:grassknot:p2": 389,
  "move:p1:grassyglide:p2": 390,
  "move:p1:gravapple:p2": 391,
  "move:p1:gunkshot:": 392,
  "move:p1:gunkshot:p2": 393,
  "move:p1:haze:p1": 394,
  "move:p1:headbutt:": 395,
  "move:p1:headbutt:p2": 396,
  "move:p1:headlongrush:p2": 397,
  "move:p1:headsmash:": 398,
  "move:p1:headsmash:p2": 399,
  "move:p1:healbell:": 400,
  "move:p1:healbell:p1": 401,
  "move:p1:healingwish:p1": 402,
  "move:p1:heatcrash:": 403,
  "move:p1:heatcrash:p2": 404,
  "move:p1:heatwave:p2": 405,
  "move:p1:heavyslam:": 406,
  "move:p1:heavyslam:p2": 407,
  "move:p1:hex:p2": 408,
  "move:p1:highhorsepower:": 409,
  "move:p1:highhorsepower:p2": 410,
  "move:p1:highjumpkick:p2": 411,
  "move:p1:hornleech:p2": 412,
  "move:p1:hurricane:": 413,
  "move:p1:hurricane:p2": 414,
  "move:p1:hydropump:": 415,
  "move:p1:hydropump:p2": 416,
  "move:p1:hydrosteam:p2": 417,
  "move:p1:hyperspacefury:p2": 418,
  "move:p1:hypervoice:p2": 419,
  "move:p1:hypnosis:p2": 420,
  "move:p1:icebeam:": 421,
  "move:p1:icebeam:p2": 422,
  "move:p1:icefang:p2": 423,
  "move:p1:icehammer:p2": 424,
  "move:p1:icepunch:p2": 425,
  "move:p1:iceshard:": 426,
  "move:p1:iceshard:p2": 427,
  "move:p1:icespinner:": 428,
  "move:p1:icespinner:p2": 429,
  "move:p1:iciclecrash:": 430,
  "move:p1:iciclecrash:p2": 431,
  "move:p1:iciclespear:p2": 432,
  "move:p1:irondefense:p1": 433,
  "move:p1:ironhead:p2": 434,
  "move:p1:irontail:p2": 435,
  "move:p1:ivycudgel:p2": 436,
  "move:p1:jetpunch:p2": 437,
  "move:p1:judgment:p2": 438,
  "move:p1:knockoff:": 439,
  "move:p1:knockoff:p2": 440,
  "move:p1:kowtowcleave:p2": 441,
  "move:p1:lashout:p2": 442,
  "move:p1:lavaplume:p2": 443,
  "move:p1:leafblade:": 444,
  "move:p1:leafblade:p2": 445,
  "move:p1:leafstorm:p2": 446,
  "move:p1:leechlife:p2": 447,
  "move:p1:leechseed:": 448,
  "move:p1:leechseed:p2": 449,
  "move:p1:lightscreen:p1": 450,
  "move:p1:liquidation:": 451,
  "move:p1:liquidation:p2": 452,
  "move:p1:lowkick:p2": 453,
  "move:p1:luminacrash:p2": 454,
  "move:p1:lunge:p2": 455,
  "move:p1:lusterpurge:p2": 456,
  "move:p1:machpunch:": 457,
  "move:p1:machpunch:p2": 458,
  "move:p1:magmastorm:p2": 459,
  "move:p1:magnetrise:p1": 460,
  "move:p1:makeitrain:p2": 461,
  "move:p1:malignantchain:p2": 462,
  "move:p1:matchagotcha:p2": 463,
  "move:p1:megahorn:p2": 464,
  "move:p1:meteorbeam:": 465,
  "move:p1:meteorbeam:p2": 466,
  "move:p1:meteormash:p2": 467,
  "move:p1:mightycleave:p2": 468,
  "move:p1:milkdrink:p1": 469,
  "move:p1:mirrorcoat:": 470,
  "move:p1:mirrorcoat:p2": 471,
  "move:p1:moonblast:": 472,
  "move:p1:moonblast:p2": 473,
  "move:p1:moongeistbeam:": 474,
  "move:p1:moongeistbeam:p2": 475,
  "move:p1:moonlight:p1": 476,
  "move:p1:morningsun:p1": 477,
  "move:p1:mortalspin:p2": 478,
  "move:p1:muddywater:p2": 479,
  "move:p1:mudshot:p2": 480,
  "move:p1:mysticalfire:p2": 481,
  "move:p1:nastyplot:p1": 482,
  "move:p1:nightshade:p2": 483,
  "move:p1:nightslash:p2": 484,
  "move:p1:noretreat:": 485,
  "move:p1:noretreat:p1": 486,
  "move:p1:nuzzle:p2": 487,
  "move:p1:originpulse:p2": 488,
  "move:p1:outrage:p2": 489,
  "move:p1:overdrive:p2": 490,
  "move:p1:overheat:": 491,
  "move:p1:overheat:p2": 492,
  "move:p1:painsplit:": 493,
  "move:p1:painsplit:p2": 494,
  "move:p1:partingshot:p2": 495,
  "move:p1:payback:p2": 496,
  "move:p1:petalblizzard:p2": 497,
  "move:p1:petaldance:p2": 498,
  "move:p1:photongeyser:": 499,
  "move:p1:photongeyser:p2": 500,
  "move:p1:playrough:": 501,
  "move:p1:playrough:p2": 502,
  "move:p1:poisonfang:p2": 503,
  "move:p1:poisonjab:p2": 504,
  "move:p1:pollenpuff:p2": 505,
  "move:p1:poltergeist:": 506,
  "move:p1:poltergeist:p2": 507,
  "move:p1:populationbomb:": 508,
  "move:p1:populationbomb:p2": 509,
  "move:p1:pounce:p2": 510,
  "move:p1:powergem:p2": 511,
  "move:p1:powertrip:p2": 512,
  "move:p1:powerwhip:": 513,
  "move:p1:powerwhip:p2": 514,
  "move:p1:precipiceblades:p2": 515,
  "move:p1:protect:": 516,
  "move:p1:protect:p1": 517,
  "move:p1:psyblade:p2": 518,
  "move:p1:psychic:": 519,
  "move:p1:psychic:p2": 520,
  "move:p1:psychicfangs:": 521,
  "move:p1:psychicfangs:p2": 522,
  "move:p1:psychicnoise:p2": 523,
  "move:p1:psychoboost:p2": 524,
  "move:p1:psychocut:p2": 525,
  "move:p1:psyshock:p2": 526,
  "move:p1:psystrike:": 527,
  "move:p1:psystrike:p2": 528,
  "move:p1:pyroball:p2": 529,
  "move:p1:quickattack:": 530,
  "move:p1:quickattack:p2": 531,
  "move:p1:quiverdance:p1": 532,
  "move:p1:ragefist:p2": 533,
  "move:p1:ragingbull:p2": 534,
  "move:p1:raindance:": 535,
  "move:p1:raindance:p1": 536,
  "move:p1:rapidspin:p2": 537,
  "move:p1:razorshell:p2": 538,
  "move:p1:recover:": 539,
  "move:p1:recover:p1": 540,
  "move:p1:reflect:p1": 541,
  "move:p1:relicsong:p2": 542,
  "move:p1:rest:": 543,
  "move:p1:rest:p1": 544,
  "move:p1:revelationdance:p2": 545,
  "move:p1:revivalblessing:p1": 546,
  "move:p1:roar:p2": 547,
  "move:p1:rockblast:p2": 548,
  "move:p1:rockpolish:p1": 549,
  "move:p1:rockslide:": 550,
  "move:p1:rockslide:p2": 551,
  "move:p1:rocktomb:p2": 552,
  "move:p1:roost:": 553,
  "move:p1:roost:p1": 554,
  "move:p1:ruination:": 555,
  "move:p1:ruination:p2": 556,
  "move:p1:sacredfire:p2": 557,
  "move:p1:sacredsword:p2": 558,
  "move:p1:saltcure:p2": 559,
  "move:p1:scald:": 560,
  "move:p1:scald:p2": 561,
  "move:p1:scaleshot:p2": 562,
  "move:p1:scorchingsands:": 563,
  "move:p1:scorchingsands:p2": 564,
  "move:p1:secretsword:p2": 565,
  "move:p1:seedbomb:p2": 566,
  "move:p1:seedflare:p2": 567,
  "move:p1:seismictoss:": 568,
  "move:p1:seismictoss:p2": 569,
  "move:p1:shadowball:": 570,
  "move:p1:shadowball:p2": 571,
  "move:p1:shadowclaw:p2": 572,
  "move:p1:shadowsneak:p2": 573,
  "move:p1:shedtail:p1": 574,
  "move:p1:shellsidearm:p2": 575,
  "move:p1:shellsmash:p1": 576,
  "move:p1:shiftgear:p1": 577,
  "move:p1:shoreup:p1": 578,
  "move:p1:slackoff:p1": 579,
  "move:p1:sleeppowder:": 580,
  "move:p1:sleeppowder:p2": 581,
  "move:p1:sleeptalk:": 582,
  "move:p1:sleeptalk:p1": 583,
  "move:p1:sludgebomb:p2": 584,
  "move:p1:sludgewave:": 585,
  "move:p1:sludgewave:p2": 586,
  "move:p1:snowscape:p1": 587,
  "move:p1:soft-boiled:": 588,
  "move:p1:soft-boiled:p1": 589,
  "move:p1:solarbeam:": 590,
  "move:p1:solarbeam:p2": 591,
  "move:p1:spacialrend:p2": 592,
  "move:p1:sparklingaria:p2": 593,
  "move:p1:spikes:": 594,
  "move:p1:spikes:p2": 595,
  "move:p1:spiritbreak:p2": 596,
  "move:p1:spiritshackle:p2": 597,
  "move:p1:spore:": 598,
  "move:p1:spore:p2": 599,
  "move:p1:stealthrock:": 600,
  "move:p1:stealthrock:p2": 601,
  "move:p1:steameruption:p2": 602,
  "move:p1:stickyweb:": 603,
  "move:p1:stickyweb:p2": 604,
  "move:p1:stompingtantrum:p2": 605,
  "move:p1:stoneaxe:p2": 606,
  "move:p1:stoneedge:": 607,
  "move:p1:stoneedge:p2": 608,
  "move:p1:storedpower:p2": 609,
  "move:p1:strangesteam:p2": 610,
  "move:p1:strengthsap:": 611,
  "move:p1:strengthsap:p2": 612,
  "move:p1:struggle:p2": 613,
  "move:p1:stunspore:p2": 614,
  "move:p1:substitute:p1": 615,
  "move:p1:suckerpunch:": 616,
  "move:p1:suckerpunch:p2": 617,
  "move:p1:sunnyday:p1": 618,
  "move:p1:sunsteelstrike:p2": 619,
  "move:p1:supercellslam:p2": 620,
  "move:p1:superfang:p2": 621,
  "move:p1:superpower:p2": 622,
  "move:p1:surf:": 623,
  "move:p1:surf:p2": 624,
  "move:p1:surgingstrikes:p2": 625,
  "move:p1:switcheroo:p2": 626,
  "move:p1:swordsdance:p1": 627,
  "move:p1:synthesis:p1": 628,
  "move:p1:tachyoncutter:p2": 629,
  "move:p1:tailglow:p1": 630,
  "move:p1:tailslap:p2": 631,
  "move:p1:tailwind:p1": 632,
  "move:p1:takeheart:": 633,
  "move:p1:takeheart:p1": 634,
  "move:p1:taunt:p2": 635,
  "move:p1:teleport:p1": 636,
  "move:p1:temperflare:p2": 637,
  "move:p1:terablast:p2": 638,
  "move:p1:terastarstorm:p2": 639,
  "move:p1:throatchop:p2": 640,
  "move:p1:thunder:p2": 641,
  "move:p1:thunderbolt:p2": 642,
  "move:p1:thunderclap:": 643,
  "move:p1:thunderclap:p2": 644,
  "move:p1:thunderpunch:p2": 645,
  "move:p1:thunderwave:": 646,
  "move:p1:thunderwave:p2": 647,
  "move:p1:tidyup:p1": 648,
  "move:p1:torchsong:p2": 649,
  "move:p1:toxic:": 650,
  "move:p1:toxic:p2": 651,
  "move:p1:toxicspikes:": 652,
  "move:p1:toxicspikes:p2": 653,
  "move:p1:trailblaze:": 654,
  "move:p1:trailblaze:p2": 655,
  "move:p1:triattack:p2": 656,
  "move:p1:trick:p2": 657,
  "move:p1:trickroom:p1": 658,
  "move:p1:triplearrows:p2": 659,
  "move:p1:tripleaxel:p2": 660,
  "move:p1:u-turn:": 661,
  "move:p1:u-turn:p2": 662,
  "move:p1:vacuumwave:p2": 663,
  "move:p1:victorydance:p1": 664,
  "move:p1:voltswitch:": 665,
  "move:p1:voltswitch:p2": 666,
  "move:p1:volttackle:p2": 667,
  "move:p1:waterfall:p2": 668,
  "move:p1:waterpulse:p2": 669,
  "move:p1:waterspout:p2": 670,
  "move:p1:wavecrash:p2": 671,
  "move:p1:weatherball:p2": 672,
  "move:p1:whirlpool:p2": 673,
  "move:p1:whirlwind:": 674,
  "move:p1:whirlwind:p2": 675,
  "move:p1:wickedblow:p2": 676,
  "move:p1:wildcharge:p2": 677,
  "move:p1:will-o-wisp:": 678,
  "move:p1:will-o-wisp:p2": 679,
  "move:p1:wish:": 680,
  "move:p1:wish:p1": 681,
  "move:p1:woodhammer:p2": 682,
  "move:p1:workup:p1": 683,
  "move:p1:x-scissor:": 684,
  "move:p1:x-scissor:p2": 685,
  "move:p1:yawn:": 686,
  "move:p1:yawn:p2": 687,
  "move:p1:zenheadbutt:p2": 688,
  "move:p1:zingzap:p2": 689,
  "move:p2:accelerock:p1": 690,
  "move:p2:acidarmor:p2": 691,
  "move:p2:acrobatics:": 692,
  "move:p2:acrobatics:p1": 693,
  "move:p2:aeroblast:": 694,
  "move:p2:aeroblast:p1": 695,
  "move:p2:agility:p2": 696,
  "move:p2:airslash:": 697,
  "move:p2:airslash:p1": 698,
  "move:p2:alluringvoice:p1": 699,
  "move:p2:appleacid:p1": 700,
  "move:p2:aquacutter:p1": 701,
  "move:p2:aquajet:p1": 702,
  "move:p2:aquastep:p1": 703,
  "move:p2:armorcannon:p1": 704,
  "move:p2:astralbarrage:p1": 705,
  "move:p2:aurasphere:p1": 706,
  "move:p2:aurawheel:p1": 707,
  "move:p2:auroraveil:": 708,
  "move:p2:auroraveil:p2": 709,
  "move:p2:avalanche:p1": 710,
  "move:p2:beakblast:p1": 711,
  "move:p2:beatup:": 712,
  "move:p2:beatup:p1": 713,
  "move:p2:behemothblade:p1": 714,
  "move:p2:bellydrum:": 715,
  "move:p2:bellydrum:p2": 716,
  "move:p2:bite:p1": 717,
  "move:p2:bitterblade:p1": 718,
  "move:p2:bittermalice:p1": 719,
  "move:p2:bleakwindstorm:": 720,
  "move:p2:bleakwindstorm:p1": 721,
  "move:p2:blizzard:p1": 722,
  "move:p2:bloodmoon:p1": 723,
  "move:p2:blueflare:p1": 724,
  "move:p2:bodypress:": 725,
  "move:p2:bodypress:p1": 726,
  "move:p2:bodyslam:": 727,
  "move:p2:bodyslam:p1": 728,
  "move:p2:boltstrike:p1": 729,
  "move:p2:boomburst:p1": 730,
  "move:p2:bravebird:": 731,
  "move:p2:bravebird:p1": 732,
  "move:p2:brickbreak:p1": 733,
  "move:p2:bugbite:p1": 734,
  "move:p2:bugbuzz:": 735,
  "move:p2:bugbuzz:p1": 736,
  "move:p2:bulkup:p2": 737,
  "move:p2:bulletpunch:p1": 738,
  "move:p2:bulletseed:p1": 739,
  "move:p2:calmmind:p2": 740,
  "move:p2:ceaselessedge:": 741,
  "move:p2:ceaselessedge:p1": 742,
  "move:p2:chillyreception:p2": 743,
  "move:p2:circlethrow:p1": 744,
  "move:p2:clangingscales:p1": 745,
  "move:p2:clangoroussoul:p2": 746,
  "move:p2:clearsmog:p1": 747,
  "move:p2:closecombat:": 748,
  "move:p2:closecombat:p1": 749,
  "move:p2:coil:p2": 750,
  "move:p2:collisioncourse:p1": 751,
  "move:p2:cosmicpower:p2": 752,
  "move:p2:courtchange:p2": 753,
  "move:p2:crabhammer:p1": 754,
  "move:p2:crunch:p1": 755,
  "move:p2:curse:p2": 756,
  "move:p2:darkpulse:": 757,
  "move:p2:darkpulse:p1": 758,
  "move:p2:dazzlinggleam:": 759,
  "move:p2:dazzlinggleam:p1": 760,
  "move:p2:defog:": 761,
  "move:p2:defog:p1": 762,
  "move:p2:destinybond:": 763,
  "move:p2:destinybond:p2": 764,
  "move:p2:diamondstorm:p1": 765,
  "move:p2:direclaw:": 766,
  "move:p2:direclaw:p1": 767,
  "move:p2:disable:": 768,
  "move:p2:disable:p1": 769,
  "move:p2:discharge:": 770,
  "move:p2:discharge:p1": 771,
  "move:p2:double-edge:": 772,
  "move:p2:double-edge:p1": 773,
  "move:p2:doubleshock:": 774,
  "move:p2:doubleshock:p1": 775,
  "move:p2:dracometeor:": 776,
  "move:p2:dracometeor:p1": 777,
  "move:p2:dragonascent:p1": 778,
  "move:p2:dragonclaw:p1": 779,
  "move:p2:dragondance:p2": 780,
  "move:p2:dragondarts:p1": 781,
  "move:p2:dragonenergy:p1": 782,
  "move:p2:dragonpulse:": 783,
  "move:p2:dragonpulse:p1": 784,
  "move:p2:dragontail:": 785,
  "move:p2:dragontail:p1": 786,
  "move:p2:drainingkiss:": 787,
  "move:p2:drainingkiss:p1": 788,
  "move:p2:drainpunch:": 789,
  "move:p2:drainpunch:p1": 790,
  "move:p2:drillrun:p1": 791,
  "move:p2:dualwingbeat:p1": 792,
  "move:p2:dynamaxcannon:": 793,
  "move:p2:dynamaxcannon:p1": 794,
  "move:p2:dynamicpunch:p1": 795,
  "move:p2:earthpower:": 796,
  "move:p2:earthpower:p1": 797,
  "move:p2:earthquake:": 798,
  "move:p2:earthquake:p1": 799,
  "move:p2:electrodrift:p1": 800,
  "move:p2:encore:": 801,
  "move:p2:encore:p1": 802,
  "move:p2:endeavor:p1": 803,
  "move:p2:energyball:p1": 804,
  "move:p2:eruption:p1": 805,
  "move:p2:esperwing:p1": 806,
  "move:p2:expandingforce:p1": 807,
  "move:p2:explosion:": 808,
  "move:p2:explosion:p1": 809,
  "move:p2:extremespeed:p1": 810,
  "move:p2:facade:p1": 811,
  "move:p2:fakeout:": 812,
  "move:p2:fakeout:p1": 813,
  "move:p2:ficklebeam:": 814,
  "move:p2:ficklebeam:p1": 815,
  "move:p2:fierydance:p1": 816,
  "move:p2:fierywrath:p1": 817,
  "move:p2:filletaway:p2": 818,
  "move:p2:fireblast:": 819,
  "move:p2:fireblast:p1": 820,
  "move:p2:firefang:p1": 821,
  "move:p2:firepunch:p1": 822,
  "move:p2:firstimpression:": 823,
  "move:p2:firstimpression:p1": 824,
  "move:p2:flamecharge:p1": 825,
  "move:p2:flamethrower:p1": 826,
  "move:p2:flareblitz:": 827,
  "move:p2:flareblitz:p1": 828,
  "move:p2:flashcannon:": 829,
  "move:p2:flashcannon:p1": 830,
  "move:p2:fleurcannon:p1": 831,
  "move:p2:flipturn:": 832,
  "move:p2:flipturn:p1": 833,
  "move:p2:flowertrick:p1": 834,
  "move:p2:focusblast:": 835,
  "move:p2:focusblast:p1": 836,
  "move:p2:focuspunch:p1": 837,
  "move:p2:foulplay:p1": 838,
  "move:p2:freeze-dry:": 839,
  "move:p2:freeze-dry:p1": 840,
  "move:p2:freezingglare:": 841,
  "move:p2:freezingglare:p1": 842,
  "move:p2:fusionflare:p1": 843,
  "move:p2:futuresight:": 844,
  "move:p2:futuresight:p1": 845,
  "move:p2:gigadrain:": 846,
  "move:p2:gigadrain:p1": 847,
  "move:p2:gigaimpact:p1": 848,
  "move:p2:gigatonhammer:p1": 849,
  "move:p2:glaciallance:p1": 850,
  "move:p2:glaiverush:p1": 851,
  "move:p2:glare:": 852,
  "move:p2:glare:p1": 853,
  "move:p2:grassknot:p1": 854,
  "move:p2:grassyglide:p1": 855,
  "move:p2:gravapple:p1": 856,
  "move:p2:gunkshot:": 857,
  "move:p2:gunkshot:p1": 858,
  "move:p2:haze:p2": 859,
  "move:p2:headbutt:p1": 860,
  "move:p2:headlongrush:p1": 861,
  "move:p2:headsmash:p1": 862,
  "move:p2:healbell:": 863,
  "move:p2:healbell:p2": 864,
  "move:p2:healingwish:p2": 865,
  "move:p2:heatcrash:": 866,
  "move:p2:heatcrash:p1": 867,
  "move:p2:heatwave:p1": 868,
  "move:p2:heavyslam:": 869,
  "move:p2:heavyslam:p1": 870,
  "move:p2:hex:p1": 871,
  "move:p2:highhorsepower:p1": 872,
  "move:p2:highjumpkick:p1": 873,
  "move:p2:hornleech:": 874,
  "move:p2:hornleech:p1": 875,
  "move:p2:hurricane:": 876,
  "move:p2:hurricane:p1": 877,
  "move:p2:hydropump:p1": 878,
  "move:p2:hydrosteam:p1": 879,
  "move:p2:hyperspacefury:p1": 880,
  "move:p2:hypervoice:": 881,
  "move:p2:hypervoice:p1": 882,
  "move:p2:hypnosis:": 883,
  "move:p2:hypnosis:p1": 884,
  "move:p2:icebeam:": 885,
  "move:p2:icebeam:p1": 886,
  "move:p2:icefang:p1": 887,
  "move:p2:icehammer:p1": 888,
  "move:p2:icepunch:p1": 889,
  "move:p2:iceshard:": 890,
  "move:p2:iceshard:p1": 891,
  "move:p2:icespinner:p1": 892,
  "move:p2:iciclecrash:": 893,
  "move:p2:iciclecrash:p1": 894,
  "move:p2:iciclespear:p1": 895,
  "move:p2:irondefense:p2": 896,
  "move:p2:ironhead:p1": 897,
  "move:p2:irontail:p1": 898,
  "move:p2:ivycudgel:p1": 899,
  "move:p2:jetpunch:p1": 900,
  "move:p2:judgment:p1": 901,
  "move:p2:knockoff:": 902,
  "move:p2:knockoff:p1": 903,
  "move:p2:kowtowcleave:p1": 904,
  "move:p2:lashout:p1": 905,
  "move:p2:lavaplume:p1": 906,
  "move:p2:leafblade:p1": 907,
  "move:p2:leafstorm:": 908,
  "move:p2:leafstorm:p1": 909,
  "move:p2:leechlife:": 910,
  "move:p2:leechlife:p1": 911,
  "move:p2:leechseed:": 912,
  "move:p2:leechseed:p1": 913,
  "move:p2:lightscreen:p2": 914,
  "move:p2:liquidation:": 915,
  "move:p2:liquidation:p1": 916,
  "move:p2:lowkick:p1": 917,
  "move:p2:luminacrash:p1": 918,
  "move:p2:lunge:p1": 919,
  "move:p2:lusterpurge:p1": 920,
  "move:p2:machpunch:p1": 921,
  "move:p2:magmastorm:p1": 922,
  "move:p2:magnetrise:p2": 923,
  "move:p2:makeitrain:p1": 924,
  "move:p2:malignantchain:": 925,
  "move:p2:malignantchain:p1": 926,
  "move:p2:matchagotcha:p1": 927,
  "move:p2:megahorn:p1": 928,
  "move:p2:meteorbeam:": 929,
  "move:p2:meteorbeam:p1": 930,
  "move:p2:meteormash:p1": 931,
  "move:p2:mightycleave:p1": 932,
  "move:p2:milkdrink:p2": 933,
  "move:p2:mirrorcoat:": 934,
  "move:p2:mirrorcoat:p1": 935,
  "move:p2:moonblast:p1": 936,
  "move:p2:moongeistbeam:p1": 937,
  "move:p2:moonlight:p2": 938,
  "move:p2:morningsun:p2": 939,
  "move:p2:mortalspin:p1": 940,
  "move:p2:muddywater:p1": 941,
  "move:p2:mudshot:p1": 942,
  "move:p2:mysticalfire:": 943,
  "move:p2:mysticalfire:p1": 944,
  "move:p2:nastyplot:p2": 945,
  "move:p2:nightshade:p1": 946,
  "move:p2:nightslash:p1": 947,
  "move:p2:noretreat:": 948,
  "move:p2:noretreat:p2": 949,
  "move:p2:nuzzle:p1": 950,
  "move:p2:originpulse:p1": 951,
  "move:p2:outrage:p1": 952,
  "move:p2:overdrive:p1": 953,
  "move:p2:overheat:p1": 954,
  "move:p2:painsplit:p1": 955,
  "move:p2:partingshot:p1": 956,
  "move:p2:payback:p1": 957,
  "move:p2:petalblizzard:p1": 958,
  "move:p2:petaldance:p1": 959,
  "move:p2:photongeyser:p1": 960,
  "move:p2:playrough:p1": 961,
  "move:p2:poisonfang:p1": 962,
  "move:p2:poisonjab:": 963,
  "move:p2:poisonjab:p1": 964,
  "move:p2:pollenpuff:p1": 965,
  "move:p2:poltergeist:": 966,
  "move:p2:poltergeist:p1": 967,
  "move:p2:populationbomb:": 968,
  "move:p2:populationbomb:p1": 969,
  "move:p2:pounce:p1": 970,
  "move:p2:powergem:p1": 971,
  "move:p2:powertrip:p1": 972,
  "move:p2:powerwhip:p1": 973,
  "move:p2:precipiceblades:p1": 974,
  "move:p2:protect:": 975,
  "move:p2:protect:p2": 976,
  "move:p2:psyblade:p1": 977,
  "move:p2:psychic:p1": 978,
  "move:p2:psychicfangs:p1": 979,
  "move:p2:psychicnoise:": 980,
  "move:p2:psychicnoise:p1": 981,
  "move:p2:psychoboost:": 982,
  "move:p2:psychoboost:p1": 983,
  "move:p2:psychocut:p1": 984,
  "move:p2:psyshock:": 985,
  "move:p2:psyshock:p1": 986,
  "move:p2:psystrike:p1": 987,
  "move:p2:pyroball:": 988,
  "move:p2:pyroball:p1": 989,
  "move:p2:quickattack:": 990,
  "move:p2:quickattack:p1": 991,
  "move:p2:quiverdance:": 992,
  "move:p2:quiverdance:p2": 993,
  "move:p2:ragefist:p1": 994,
  "move:p2:ragingbull:p1": 995,
  "move:p2:raindance:p2": 996,
  "move:p2:rapidspin:p1": 997,
  "move:p2:razorshell:p1": 998,
  "move:p2:recover:": 999,
  "move:p2:recover:p2": 1000,
  "move:p2:reflect:p2": 1001,
  "move:p2:relicsong:p1": 1002,
  "move:p2:rest:": 1003,
  "move:p2:rest:p2": 1004,
  "move:p2:revelationdance:": 1005,
  "move:p2:revelationdance:p1": 1006,
  "move:p2:revivalblessing:p2": 1007,
  "move:p2:roar:": 1008,
  "move:p2:roar:p1": 1009,
  "move:p2:rockblast:p1": 1010,
  "move:p2:rockpolish:p2": 1011,
  "move:p2:rockslide:p1": 1012,
  "move:p2:rocktomb:p1": 1013,
  "move:p2:roost:": 1014,
  "move:p2:roost:p2": 1015,
  "move:p2:ruination:p1": 1016,
  "move:p2:sacredfire:p1": 1017,
  "move:p2:sacredsword:p1": 1018,
  "move:p2:saltcure:": 1019,
  "move:p2:saltcure:p1": 1020,
  "move:p2:scald:": 1021,
  "move:p2:scald:p1": 1022,
  "move:p2:scaleshot:p1": 1023,
  "move:p2:scorchingsands:p1": 1024,
  "move:p2:secretsword:p1": 1025,
  "move:p2:seedbomb:p1": 1026,
  "move:p2:seedflare:p1": 1027,
  "move:p2:seismictoss:p1": 1028,
  "move:p2:shadowball:": 1029,
  "move:p2:shadowball:p1": 1030,
  "move:p2:shadowclaw:p1": 1031,
  "move:p2:shadowsneak:p1": 1032,
  "move:p2:shedtail:p2": 1033,
  "move:p2:shellsidearm:p1": 1034,
  "move:p2:shellsmash:p2": 1035,
  "move:p2:shiftgear:p2": 1036,
  "move:p2:shoreup:p2": 1037,
  "move:p2:slackoff:": 1038,
  "move:p2:slackoff:p2": 1039,
  "move:p2:sleeppowder:": 1040,
  "move:p2:sleeppowder:p1": 1041,
  "move:p2:sleeptalk:": 1042,
  "move:p2:sleeptalk:p2": 1043,
  "move:p2:sludgebomb:p1": 1044,
  "move:p2:sludgewave:p1": 1045,
  "move:p2:snowscape:p2": 1046,
  "move:p2:soft-boiled:": 1047,
  "move:p2:soft-boiled:p2": 1048,
  "move:p2:solarbeam:": 1049,
  "move:p2:solarbeam:p1": 1050,
  "move:p2:spacialrend:p1": 1051,
  "move:p2:sparklingaria:p1": 1052,
  "move:p2:spikes:": 1053,
  "move:p2:spikes:p1": 1054,
  "move:p2:spiritbreak:p1": 1055,
  "move:p2:spiritshackle:p1": 1056,
  "move:p2:spore:": 1057,
  "move:p2:spore:p1": 1058,
  "move:p2:stealthrock:": 1059,
  "move:p2:stealthrock:p1": 1060,
  "move:p2:steameruption:p1": 1061,
  "move:p2:stickyweb:": 1062,
  "move:p2:stickyweb:p1": 1063,
  "move:p2:stompingtantrum:p1": 1064,
  "move:p2:stoneaxe:p1": 1065,
  "move:p2:stoneedge:p1": 1066,
  "move:p2:storedpower:p1": 1067,
  "move:p2:strangesteam:p1": 1068,
  "move:p2:strengthsap:": 1069,
  "move:p2:strengthsap:p1": 1070,
  "move:p2:struggle:p1": 1071,
  "move:p2:stunspore:p1": 1072,
  "move:p2:substitute:p2": 1073,
  "move:p2:suckerpunch:": 1074,
  "move:p2:suckerpunch:p1": 1075,
  "move:p2:sunnyday:": 1076,
  "move:p2:sunnyday:p2": 1077,
  "move:p2:sunsteelstrike:p1": 1078,
  "move:p2:supercellslam:p1": 1079,
  "move:p2:superfang:": 1080,
  "move:p2:superfang:p1": 1081,
  "move:p2:superpower:": 1082,
  "move:p2:superpower:p1": 1083,
  "move:p2:surf:p1": 1084,
  "move:p2:surgingstrikes:p1": 1085,
  "move:p2:switcheroo:": 1086,
  "move:p2:switcheroo:p1": 1087,
  "move:p2:swordsdance:p2": 1088,
  "move:p2:synthesis:p2": 1089,
  "move:p2:tachyoncutter:p1": 1090,
  "move:p2:tailglow:p2": 1091,
  "move:p2:tailslap:p1": 1092,
  "move:p2:tailwind:p2": 1093,
  "move:p2:takeheart:p2": 1094,
  "move:p2:taunt:p1": 1095,
  "move:p2:teleport:p2": 1096,
  "move:p2:temperflare:p1": 1097,
  "move:p2:terablast:p1": 1098,
  "move:p2:terastarstorm:p1": 1099,
  "move:p2:throatchop:": 1100,
  "move:p2:throatchop:p1": 1101,
  "move:p2:thunder:": 1102,
  "move:p2:thunder:p1": 1103,
  "move:p2:thunderbolt:": 1104,
  "move:p2:thunderbolt:p1": 1105,
  "move:p2:thunderclap:": 1106,
  "move:p2:thunderclap:p1": 1107,
  "move:p2:thunderpunch:p1": 1108,
  "move:p2:thunderwave:": 1109,
  "move:p2:thunderwave:p1": 1110,
  "move:p2:tidyup:p2": 1111,
  "move:p2:torchsong:p1": 1112,
  "move:p2:toxic:": 1113,
  "move:p2:toxic:p1": 1114,
  "move:p2:toxicspikes:": 1115,
  "move:p2:toxicspikes:p1": 1116,
  "move:p2:trailblaze:p1": 1117,
  "move:p2:triattack:p1": 1118,
  "move:p2:trick:": 1119,
  "move:p2:trick:p1": 1120,
  "move:p2:trickroom:p2": 1121,
  "move:p2:triplearrows:p1": 1122,
  "move:p2:tripleaxel:p1": 1123,
  "move:p2:u-turn:": 1124,
  "move:p2:u-turn:p1": 1125,
  "move:p2:vacuumwave:p1": 1126,
  "move:p2:victorydance:p2": 1127,
  "move:p2:voltswitch:": 1128,
  "move:p2:voltswitch:p1": 1129,
  "move:p2:volttackle:p1": 1130,
  "move:p2:waterfall:p1": 1131,
  "move:p2:waterpulse:p1": 1132,
  "move:p2:waterspout:p1": 1133,
  "move:p2:wavecrash:p1": 1134,
  "move:p2:weatherball:p1": 1135,
  "move:p2:whirlpool:p1": 1136,
  "move:p2:whirlwind:p1": 1137,
  "move:p2:wickedblow:p1": 1138,
  "move:p2:wildcharge:p1": 1139,
  "move:p2:will-o-wisp:": 1140,
  "move:p2:will-o-wisp:p1": 1141,
  "move:p2:wish:": 1142,
  "move:p2:wish:p2": 1143,
  "move:p2:woodhammer:p1": 1144,
  "move:p2:workup:p2": 1145,
  "move:p2:x-scissor:p1": 1146,
  "move:p2:yawn:": 1147,
  "move:p2:yawn:p1": 1148,
  "move:p2:zenheadbutt:p1": 1149,
  "move:p2:zingzap:p1": 1150,
  "side_condition:p1:auroraveil:end": 1151,
  "side_condition:p1:auroraveil:start": 1152,
  "side_condition:p1:lightscreen:end": 1153,
  "side_condition:p1:lightscreen:start": 1154,
  "side_condition:p1:reflect:end": 1155,
  "side_condition:p1:reflect:start": 1156,
  "side_condition:p1:spikes:end": 1157,
  "side_condition:p1:spikes:start": 1158,
  "side_condition:p1:stealthrock:end": 1159,
  "side_condition:p1:stealthrock:start": 1160,
  "side_condition:p1:stickyweb:end": 1161,
  "side_condition:p1:stickyweb:start": 1162,
  "side_condition:p1:tailwind:end": 1163,
  "side_condition:p1:tailwind:start": 1164,
  "side_condition:p1:toxicspikes:end": 1165,
  "side_condition:p1:toxicspikes:start": 1166,
  "side_condition:p2:auroraveil:end": 1167,
  "side_condition:p2:auroraveil:start": 1168,
  "side_condition:p2:lightscreen:end": 1169,
  "side_condition:p2:lightscreen:start": 1170,
  "side_condition:p2:reflect:end": 1171,
  "side_condition:p2:reflect:start": 1172,
  "side_condition:p2:spikes:end": 1173,
  "side_condition:p2:spikes:start": 1174,
  "side_condition:p2:stealthrock:end": 1175,
  "side_condition:p2:stealthrock:start": 1176,
  "side_condition:p2:stickyweb:end": 1177,
  "side_condition:p2:stickyweb:start": 1178,
  "side_condition:p2:tailwind:end": 1179,
  "side_condition:p2:tailwind:start": 1180,
  "side_condition:p2:toxicspikes:end": 1181,
  "side_condition:p2:toxicspikes:start": 1182,
  "status_end:p1:brn": 1183,
  "status_end:p1:frz": 1184,
  "status_end:p1:par": 1185,
  "status_end:p1:psn": 1186,
  "status_end:p1:slp": 1187,
  "status_end:p1:tox": 1188,
  "status_end:p2:brn": 1189,
  "status_end:p2:frz": 1190,
  "status_end:p2:par": 1191,
  "status_end:p2:psn": 1192,
  "status_end:p2:slp": 1193,
  "status_end:p2:tox": 1194,
  "status_start:p1:brn": 1195,
  "status_start:p1:frz": 1196,
  "status_start:p1:par": 1197,
  "status_start:p1:psn": 1198,
  "status_start:p1:slp": 1199,
  "status_start:p1:tox": 1200,
  "status_start:p2:brn": 1201,
  "status_start:p2:frz": 1202,
  "status_start:p2:par": 1203,
  "status_start:p2:psn": 1204,
  "status_start:p2:slp": 1205,
  "status_start:p2:tox": 1206,
  "switch:p1:Abomasnow:1": 1207,
  "switch:p1:Abomasnow:2": 1208,
  "switch:p1:Abomasnow:3": 1209,
  "switch:p1:Abomasnow:4": 1210,
  "switch:p1:Abomasnow:5": 1211,
  "switch:p1:Abomasnow:6": 1212,
  "switch:p1:Alcremie:1": 1213,
  "switch:p1:Alcremie:2": 1214,
  "switch:p1:Alcremie:3": 1215,
  "switch:p1:Alcremie:4": 1216,
  "switch:p1:Alcremie:5": 1217,
  "switch:p1:Alcremie:6": 1218,
  "switch:p1:Alomomola:1": 1219,
  "switch:p1:Alomomola:2": 1220,
  "switch:p1:Alomomola:3": 1221,
  "switch:p1:Alomomola:4": 1222,
  "switch:p1:Alomomola:5": 1223,
  "switch:p1:Alomomola:6": 1224,
  "switch:p1:Altaria:1": 1225,
  "switch:p1:Altaria:2": 1226,
  "switch:p1:Altaria:3": 1227,
  "switch:p1:Altaria:5": 1228,
  "switch:p1:Altaria:6": 1229,
  "switch:p1:Ambipom:1": 1230,
  "switch:p1:Ambipom:2": 1231,
  "switch:p1:Ambipom:3": 1232,
  "switch:p1:Ambipom:4": 1233,
  "switch:p1:Ambipom:5": 1234,
  "switch:p1:Ambipom:6": 1235,
  "switch:p1:Amoonguss:1": 1236,
  "switch:p1:Amoonguss:2": 1237,
  "switch:p1:Amoonguss:3": 1238,
  "switch:p1:Amoonguss:4": 1239,
  "switch:p1:Amoonguss:5": 1240,
  "switch:p1:Amoonguss:6": 1241,
  "switch:p1:Ampharos:1": 1242,
  "switch:p1:Ampharos:2": 1243,
  "switch:p1:Ampharos:3": 1244,
  "switch:p1:Ampharos:4": 1245,
  "switch:p1:Ampharos:5": 1246,
  "switch:p1:Ampharos:6": 1247,
  "switch:p1:Annihilape:1": 1248,
  "switch:p1:Annihilape:2": 1249,
  "switch:p1:Annihilape:3": 1250,
  "switch:p1:Annihilape:4": 1251,
  "switch:p1:Annihilape:5": 1252,
  "switch:p1:Annihilape:6": 1253,
  "switch:p1:Appletun:1": 1254,
  "switch:p1:Appletun:2": 1255,
  "switch:p1:Appletun:3": 1256,
  "switch:p1:Appletun:4": 1257,
  "switch:p1:Appletun:5": 1258,
  "switch:p1:Appletun:6": 1259,
  "switch:p1:Araquanid:1": 1260,
  "switch:p1:Araquanid:2": 1261,
  "switch:p1:Araquanid:3": 1262,
  "switch:p1:Araquanid:4": 1263,
  "switch:p1:Araquanid:5": 1264,
  "switch:p1:Araquanid:6": 1265,
  "switch:p1:Arbok:1": 1266,
  "switch:p1:Arbok:2": 1267,
  "switch:p1:Arbok:3": 1268,
  "switch:p1:Arbok:4": 1269,
  "switch:p1:Arbok:5": 1270,
  "switch:p1:Arbok:6": 1271,
  "switch:p1:Arboliva:1": 1272,
  "switch:p1:Arboliva:2": 1273,
  "switch:p1:Arboliva:3": 1274,
  "switch:p1:Arboliva:4": 1275,
  "switch:p1:Arboliva:5": 1276,
  "switch:p1:Arboliva:6": 1277,
  "switch:p1:Arcanine:1": 1278,
  "switch:p1:Arcanine:2": 1279,
  "switch:p1:Arcanine:3": 1280,
  "switch:p1:Arcanine:4": 1281,
  "switch:p1:Arcanine:5": 1282,
  "switch:p1:Arcanine:6": 1283,
  "switch:p1:Arceus:1": 1284,
  "switch:p1:Arceus:2": 1285,
  "switch:p1:Arceus:3": 1286,
  "switch:p1:Arceus:4": 1287,
  "switch:p1:Arceus:5": 1288,
  "switch:p1:Arceus:6": 1289,
  "switch:p1:Archaludon:1": 1290,
  "switch:p1:Archaludon:2": 1291,
  "switch:p1:Archaludon:3": 1292,
  "switch:p1:Archaludon:4": 1293,
  "switch:p1:Archaludon:5": 1294,
  "switch:p1:Archaludon:6": 1295,
  "switch:p1:Ariados:1": 1296,
  "switch:p1:Ariados:2": 1297,
  "switch:p1:Ariados:3": 1298,
  "switch:p1:Ariados:4": 1299,
  "switch:p1:Ariados:5": 1300,
  "switch:p1:Ariados:6": 1301,
  "switch:p1:Armarouge:1": 1302,
  "switch:p1:Armarouge:2": 1303,
  "switch:p1:Armarouge:3": 1304,
  "switch:p1:Armarouge:4": 1305,
  "switch:p1:Armarouge:5": 1306,
  "switch:p1:Armarouge:6": 1307,
  "switch:p1:Articuno:1": 1308,
  "switch:p1:Articuno:2": 1309,
  "switch:p1:Articuno:3": 1310,
  "switch:p1:Articuno:4": 1311,
  "switch:p1:Articuno:5": 1312,
  "switch:p1:Articuno:6": 1313,
  "switch:p1:Avalugg:1": 1314,
  "switch:p1:Avalugg:2": 1315,
  "switch:p1:Avalugg:3": 1316,
  "switch:p1:Avalugg:4": 1317,
  "switch:p1:Avalugg:5": 1318,
  "switch:p1:Avalugg:6": 1319,
  "switch:p1:Azelf:1": 1320,
  "switch:p1:Azelf:2": 1321,
  "switch:p1:Azelf:3": 1322,
  "switch:p1:Azelf:4": 1323,
  "switch:p1:Azelf:5": 1324,
  "switch:p1:Azelf:6": 1325,
  "switch:p1:Azumarill:1": 1326,
  "switch:p1:Azumarill:2": 1327,
  "switch:p1:Azumarill:3": 1328,
  "switch:p1:Azumarill:4": 1329,
  "switch:p1:Azumarill:5": 1330,
  "switch:p1:Azumarill:6": 1331,
  "switch:p1:Banette:1": 1332,
  "switch:p1:Banette:2": 1333,
  "switch:p1:Banette:3": 1334,
  "switch:p1:Banette:4": 1335,
  "switch:p1:Banette:5": 1336,
  "switch:p1:Banette:6": 1337,
  "switch:p1:Barraskewda:1": 1338,
  "switch:p1:Barraskewda:2": 1339,
  "switch:p1:Barraskewda:3": 1340,
  "switch:p1:Barraskewda:4": 1341,
  "switch:p1:Barraskewda:5": 1342,
  "switch:p1:Barraskewda:6": 1343,
  "switch:p1:Basculegion:1": 1344,
  "switch:p1:Basculegion:2": 1345,
  "switch:p1:Basculegion:3": 1346,
  "switch:p1:Basculegion:4": 1347,
  "switch:p1:Basculegion:5": 1348,
  "switch:p1:Basculegion:6": 1349,
  "switch:p1:Basculin:1": 1350,
  "switch:p1:Basculin:2": 1351,
  "switch:p1:Basculin:3": 1352,
  "switch:p1:Basculin:4": 1353,
  "switch:p1:Basculin:5": 1354,
  "switch:p1:Basculin:6": 1355,
  "switch:p1:Bastiodon:1": 1356,
  "switch:p1:Bastiodon:2": 1357,
  "switch:p1:Bastiodon:3": 1358,
  "switch:p1:Bastiodon:4": 1359,
  "switch:p1:Bastiodon:5": 1360,
  "switch:p1:Bastiodon:6": 1361,
  "switch:p1:Baxcalibur:0": 1362,
  "switch:p1:Baxcalibur:1": 1363,
  "switch:p1:Baxcalibur:2": 1364,
  "switch:p1:Baxcalibur:3": 1365,
  "switch:p1:Baxcalibur:4": 1366,
  "switch:p1:Baxcalibur:5": 1367,
  "switch:p1:Baxcalibur:6": 1368,
  "switch:p1:Beartic:1": 1369,
  "switch:p1:Beartic:2": 1370,
  "switch:p1:Beartic:3": 1371,
  "switch:p1:Beartic:4": 1372,
  "switch:p1:Beartic:5": 1373,
  "switch:p1:Beartic:6": 1374,
  "switch:p1:Bellibolt:1": 1375,
  "switch:p1:Bellibolt:2": 1376,
  "switch:p1:Bellibolt:3": 1377,
  "switch:p1:Bellibolt:4": 1378,
  "switch:p1:Bellibolt:5": 1379,
  "switch:p1:Bellibolt:6": 1380,
  "switch:p1:Bellossom:1": 1381,
  "switch:p1:Bellossom:2": 1382,
  "switch:p1:Bellossom:3": 1383,
  "switch:p1:Bellossom:4": 1384,
  "switch:p1:Bellossom:5": 1385,
  "switch:p1:Bellossom:6": 1386,
  "switch:p1:Blastoise:1": 1387,
  "switch:p1:Blastoise:2": 1388,
  "switch:p1:Blastoise:3": 1389,
  "switch:p1:Blastoise:4": 1390,
  "switch:p1:Blastoise:5": 1391,
  "switch:p1:Blastoise:6": 1392,
  "switch:p1:Blaziken:1": 1393,
  "switch:p1:Blaziken:2": 1394,
  "switch:p1:Blaziken:3": 1395,
  "switch:p1:Blaziken:4": 1396,
  "switch:p1:Blaziken:5": 1397,
  "switch:p1:Blaziken:6": 1398,
  "switch:p1:Blissey:1": 1399,
  "switch:p1:Blissey:2": 1400,
  "switch:p1:Blissey:3": 1401,
  "switch:p1:Blissey:4": 1402,
  "switch:p1:Blissey:5": 1403,
  "switch:p1:Blissey:6": 1404,
  "switch:p1:Bombirdier:1": 1405,
  "switch:p1:Bombirdier:2": 1406,
  "switch:p1:Bombirdier:3": 1407,
  "switch:p1:Bombirdier:4": 1408,
  "switch:p1:Bombirdier:5": 1409,
  "switch:p1:Bombirdier:6": 1410,
  "switch:p1:Brambleghast:1": 1411,
  "switch:p1:Brambleghast:2": 1412,
  "switch:p1:Brambleghast:3": 1413,
  "switch:p1:Brambleghast:4": 1414,
  "switch:p1:Brambleghast:5": 1415,
  "switch:p1:Brambleghast:6": 1416,
  "switch:p1:Braviary:1": 1417,
  "switch:p1:Braviary:2": 1418,
  "switch:p1:Braviary:3": 1419,
  "switch:p1:Braviary:4": 1420,
  "switch:p1:Braviary:5": 1421,
  "switch:p1:Braviary:6": 1422,
  "switch:p1:Breloom:1": 1423,
  "switch:p1:Breloom:2": 1424,
  "switch:p1:Breloom:3": 1425,
  "switch:p1:Breloom:4": 1426,
  "switch:p1:Breloom:5": 1427,
  "switch:p1:Breloom:6": 1428,
  "switch:p1:Bronzong:1": 1429,
  "switch:p1:Bronzong:2": 1430,
  "switch:p1:Bronzong:3": 1431,
  "switch:p1:Bronzong:4": 1432,
  "switch:p1:Bronzong:5": 1433,
  "switch:p1:Bronzong:6": 1434,
  "switch:p1:Brute Bonnet:1": 1435,
  "switch:p1:Brute Bonnet:2": 1436,
  "switch:p1:Brute Bonnet:3": 1437,
  "switch:p1:Brute Bonnet:4": 1438,
  "switch:p1:Brute Bonnet:5": 1439,
  "switch:p1:Brute Bonnet:6": 1440,
  "switch:p1:Bruxish:1": 1441,
  "switch:p1:Bruxish:2": 1442,
  "switch:p1:Bruxish:3": 1443,
  "switch:p1:Bruxish:4": 1444,
  "switch:p1:Bruxish:5": 1445,
  "switch:p1:Bruxish:6": 1446,
  "switch:p1:Cacturne:1": 1447,
  "switch:p1:Cacturne:2": 1448,
  "switch:p1:Cacturne:3": 1449,
  "switch:p1:Cacturne:4": 1450,
  "switch:p1:Cacturne:5": 1451,
  "switch:p1:Cacturne:6": 1452,
  "switch:p1:Calyrex:1": 1453,
  "switch:p1:Calyrex:2": 1454,
  "switch:p1:Calyrex:3": 1455,
  "switch:p1:Calyrex:4": 1456,
  "switch:p1:Calyrex:5": 1457,
  "switch:p1:Calyrex:6": 1458,
  "switch:p1:Camerupt:1": 1459,
  "switch:p1:Camerupt:2": 1460,
  "switch:p1:Camerupt:3": 1461,
  "switch:p1:Camerupt:4": 1462,
  "switch:p1:Camerupt:5": 1463,
  "switch:p1:Camerupt:6": 1464,
  "switch:p1:Carbink:1": 1465,
  "switch:p1:Carbink:2": 1466,
  "switch:p1:Carbink:3": 1467,
  "switch:p1:Carbink:4": 1468,
  "switch:p1:Carbink:5": 1469,
  "switch:p1:Carbink:6": 1470,
  "switch:p1:Ceruledge:1": 1471,
  "switch:p1:Ceruledge:2": 1472,
  "switch:p1:Ceruledge:3": 1473,
  "switch:p1:Ceruledge:4": 1474,
  "switch:p1:Ceruledge:5": 1475,
  "switch:p1:Ceruledge:6": 1476,
  "switch:p1:Cetitan:1": 1477,
  "switch:p1:Cetitan:2": 1478,
  "switch:p1:Cetitan:3": 1479,
  "switch:p1:Cetitan:4": 1480,
  "switch:p1:Cetitan:5": 1481,
  "switch:p1:Cetitan:6": 1482,
  "switch:p1:Chandelure:1": 1483,
  "switch:p1:Chandelure:2": 1484,
  "switch:p1:Chandelure:3": 1485,
  "switch:p1:Chandelure:4": 1486,
  "switch:p1:Chandelure:5": 1487,
  "switch:p1:Chandelure:6": 1488,
  "switch:p1:Chansey:1": 1489,
  "switch:p1:Chansey:2": 1490,
  "switch:p1:Chansey:3": 1491,
  "switch:p1:Chansey:4": 1492,
  "switch:p1:Chansey:5": 1493,
  "switch:p1:Chansey:6": 1494,
  "switch:p1:Charizard:1": 1495,
  "switch:p1:Charizard:2": 1496,
  "switch:p1:Charizard:3": 1497,
  "switch:p1:Charizard:4": 1498,
  "switch:p1:Charizard:5": 1499,
  "switch:p1:Charizard:6": 1500,
  "switch:p1:Chesnaught:1": 1501,
  "switch:p1:Chesnaught:2": 1502,
  "switch:p1:Chesnaught:3": 1503,
  "switch:p1:Chesnaught:4": 1504,
  "switch:p1:Chesnaught:5": 1505,
  "switch:p1:Chesnaught:6": 1506,
  "switch:p1:Chi:1": 1507,
  "switch:p1:Chi:2": 1508,
  "switch:p1:Chi:3": 1509,
  "switch:p1:Chi:4": 1510,
  "switch:p1:Chi:5": 1511,
  "switch:p1:Chi:6": 1512,
  "switch:p1:Chien:1": 1513,
  "switch:p1:Chien:2": 1514,
  "switch:p1:Chien:3": 1515,
  "switch:p1:Chien:4": 1516,
  "switch:p1:Chien:5": 1517,
  "switch:p1:Chien:6": 1518,
  "switch:p1:Chimecho:1": 1519,
  "switch:p1:Chimecho:2": 1520,
  "switch:p1:Chimecho:3": 1521,
  "switch:p1:Chimecho:4": 1522,
  "switch:p1:Chimecho:5": 1523,
  "switch:p1:Chimecho:6": 1524,
  "switch:p1:Cinccino:1": 1525,
  "switch:p1:Cinccino:2": 1526,
  "switch:p1:Cinccino:3": 1527,
  "switch:p1:Cinccino:4": 1528,
  "switch:p1:Cinccino:5": 1529,
  "switch:p1:Cinccino:6": 1530,
  "switch:p1:Cinderace:1": 1531,
  "switch:p1:Cinderace:2": 1532,
  "switch:p1:Cinderace:3": 1533,
  "switch:p1:Cinderace:4": 1534,
  "switch:p1:Cinderace:5": 1535,
  "switch:p1:Cinderace:6": 1536,
  "switch:p1:Clawitzer:1": 1537,
  "switch:p1:Clawitzer:2": 1538,
  "switch:p1:Clawitzer:3": 1539,
  "switch:p1:Clawitzer:4": 1540,
  "switch:p1:Clawitzer:5": 1541,
  "switch:p1:Clawitzer:6": 1542,
  "switch:p1:Clefable:1": 1543,
  "switch:p1:Clefable:2": 1544,
  "switch:p1:Clefable:3": 1545,
  "switch:p1:Clefable:4": 1546,
  "switch:p1:Clefable:5": 1547,
  "switch:p1:Clefable:6": 1548,
  "switch:p1:Clodsire:1": 1549,
  "switch:p1:Clodsire:2": 1550,
  "switch:p1:Clodsire:3": 1551,
  "switch:p1:Clodsire:4": 1552,
  "switch:p1:Clodsire:5": 1553,
  "switch:p1:Clodsire:6": 1554,
  "switch:p1:Cloyster:1": 1555,
  "switch:p1:Cloyster:2": 1556,
  "switch:p1:Cloyster:3": 1557,
  "switch:p1:Cloyster:4": 1558,
  "switch:p1:Cloyster:5": 1559,
  "switch:p1:Cloyster:6": 1560,
  "switch:p1:Coalossal:1": 1561,
  "switch:p1:Coalossal:2": 1562,
  "switch:p1:Coalossal:3": 1563,
  "switch:p1:Coalossal:4": 1564,
  "switch:p1:Coalossal:5": 1565,
  "switch:p1:Coalossal:6": 1566,
  "switch:p1:Cobalion:1": 1567,
  "switch:p1:Cobalion:2": 1568,
  "switch:p1:Cobalion:3": 1569,
  "switch:p1:Cobalion:4": 1570,
  "switch:p1:Cobalion:5": 1571,
  "switch:p1:Cobalion:6": 1572,
