{
  "<UNK>": 0,
  "switch:1": 1,
  "switch:2": 2,
  "switch:3": 3,
  "switch:4": 4,
  "switch:5": 5,
  "switch:6": 6,
  "move:knockoff": 7,
  "move:earthquake": 8,
  "move:calmmind": 9,
  "move:closecombat": 10,
  "move:thunderbolt": 11,
  "move:protect": 12,
  "move:u-turn": 13,
  "move:recover": 14,
  "move:swordsdance": 15,
  "move:thunderwave": 16,
  "move:shadowball": 17,
  "move:bodypress": 18,
  "move:bodyslam": 19,
  "move:scald": 20,
  "move:substitute": 21,
  "move:bravebird": 22,
  "move:moonblast": 23,
  "move:wish": 24,
  "move:roost": 25,
  "move:icebeam": 26,
  "move:dragondance": 27,
  "move:ironhead": 28,
  "move:hydropump": 29,
  "move:hurricane": 30,
  "move:stealthrock": 31,
  "move:fireblast": 32,
  "move:nastyplot": 33,
  "move:stoneedge": 34,
  "move:playrough": 35,
  "move:psyshock": 36,
  "move:gigadrain": 37,
  "move:gunkshot": 38,
  "move:psychicnoise": 39,
  "move:quiverdance": 40,
  "move:sludgebomb": 41,
  "move:drainpunch": 42,
  "move:leechseed": 43,
  "move:darkpulse": 44,
  "move:bulkup": 45,
  "move:toxic": 46,
  "move:encore": 47,
  "move:poltergeist": 48,
  "move:earthpower": 49,
  "move:spikes": 50,
  "move:dracometeor": 51,
  "move:suckerpunch": 52,
  "move:voltswitch": 53,
  "move:will-o-wisp": 54,
  "move:liquidation": 55,
  "move:strengthsap": 56,
  "move:irondefense": 57,
  "move:hypervoice": 58,
  "move:psychic": 59,
  "move:rapidspin": 60,
  "move:freeze-dry": 61,
  "move:outrage": 62,
  "move:dazzlinggleam": 63,
  "move:flipturn": 64,
  "move:bugbuzz": 65,
  "move:surf": 66,
  "move:focusblast": 67,
  "move:double-edge": 68,
  "move:terablast": 69,
  "move:stickyweb": 70,
  "move:airslash": 71,
  "move:flareblitz": 72,
  "move:foulplay": 73,
  "move:rest": 74,
  "move:seismictoss": 75,
  "move:sleeptalk": 76,
  "move:alluringvoice": 77,
  "move:drainingkiss": 78,
  "move:sludgewave": 79,
  "move:wavecrash": 80,
  "move:sleeppowder": 81,
  "move:crunch": 82,
  "move:curse": 83,
  "move:toxicspikes": 84,
  "move:tripleaxel": 85,
  "move:shellsmash": 86,
  "move:heavyslam": 87,
  "move:flamethrower": 88,
  "move:facade": 89,
  "move:iciclecrash": 90,
  "move:discharge": 91,
  "move:dragontail": 92,
  "move:flashcannon": 93,
  "move:coil": 94,
  "move:leafblade": 95,
  "move:shadowsneak": 96,
  "move:acrobatics": 97,
  "move:trailblaze": 98,
  "move:superpower": 99,
  "move:cosmicpower": 100,
  "move:poisonjab": 101,
  "move:taunt": 102,
  "move:leafstorm": 103,
  "move:slackoff": 104,
  "move:iceshard": 105,
  "move:powerwhip": 106,
  "move:storedpower": 107,
  "move:dragonpulse": 108,
  "move:throatchop": 109,
  "move:moonlight": 110,
  "move:icepunch": 111,
  "move:spore": 112,
  "move:hornleech": 113,
  "move:fakeout": 114,
  "move:highhorsepower": 115,
  "move:synthesis": 116,
  "move:boomburst": 117,
  "move:energyball": 118,
  "move:heatcrash": 119,
  "move:scaleshot": 120,
  "move:overheat": 121,
  "move:saltcure": 122,
  "move:haze": 123,
  "move:partingshot": 124,
  "move:judgment": 125,
  "move:revelationdance": 126,
  "move:sacredfire": 127,
  "move:superfang": 128,
  "move:aquajet": 129,
  "move:machpunch": 130,
  "move:psychicfangs": 131,
  "move:lavaplume": 132,
  "move:mysticalfire": 133,
  "move:nuzzle": 134,
  "move:waterfall": 135,
  "move:extremespeed": 136,
  "move:roar": 137,
  "move:icespinner": 138,
  "move:populationbomb": 139,
  "move:trick": 140,
  "move:yawn": 141,
  "move:aeroblast": 142,
  "move:glare": 143,
  "move:megahorn": 144,
  "move:supercellslam": 145,
  "move:woodhammer": 146,
  "move:headsmash": 147,
  "move:highjumpkick": 148,
  "move:tidyup": 149,
  "move:bulletpunch": 150,
  "move:dualwingbeat": 151,
  "move:soft-boiled": 152,
  "move:bulletseed": 153,
  "move:defog": 154,
  "move:ivycudgel": 155,
  "move:morningsun": 156,
  "move:stompingtantrum": 157,
  "move:leechlife": 158,
  "move:seedflare": 159,
  "move:thunder": 160,
  "move:aurasphere": 161,
  "move:weatherball": 162,
  "move:triattack": 163,
  "move:wildcharge": 164,
  "move:blizzard": 165,
  "move:grassknot": 166,
  "move:iciclespear": 167,
  "move:aurawheel": 168,
  "move:bleakwindstorm": 169,
  "move:moongeistbeam": 170,
  "move:takeheart": 171,
  "move:rockslide": 172,
  "move:shiftgear": 173,
  "move:headbutt": 174,
  "move:auroraveil": 175,
  "move:acidarmor": 176,
  "move:zenheadbutt": 177,
  "move:powergem": 178,
  "move:spiritbreak": 179,
  "move:ficklebeam": 180,
  "move:psychocut": 181,
  "move:painsplit": 182,
  "move:lunge": 183,
  "move:matchagotcha": 184,
  "move:secretsword": 185,
  "move:sunsteelstrike": 186,
  "move:meteorbeam": 187,
  "move:malignantchain": 188,
  "move:agility": 189,
  "move:torchsong": 190,
  "move:fierydance": 191,
  "move:bitterblade": 192,
  "move:flamecharge": 193,
  "move:rockpolish": 194,
  "move:sacredsword": 195,
  "move:appleacid": 196,
  "move:quickattack": 197,
  "move:ceaselessedge": 198,
  "move:rockblast": 199,
  "move:firstimpression": 200,
  "move:whirlwind": 201,
  "move:bellydrum": 202,
  "move:muddywater": 203,
  "move:diamondstorm": 204,
  "move:sparklingaria": 205,
  "move:jetpunch": 206,
  "move:lowkick": 207,
  "move:psystrike": 208,
  "move:freezingglare": 209,
  "move:heatwave": 210,
  "move:steameruption": 211,
  "move:dynamaxcannon": 212,
  "move:hypnosis": 213,
  "move:milkdrink": 214,
  "move:sunnyday": 215,
  "move:aquastep": 216,
  "move:scorchingsands": 217,
  "move:shedtail": 218,
  "move:waterspout": 219,
  "move:pyroball": 220,
  "move:revivalblessing": 221,
  "move:stunspore": 222,
  "move:endeavor": 223,
  "move:headlongrush": 224,
  "move:seedbomb": 225,
  "move:solarbeam": 226,
  "move:tailslap": 227,
  "move:zingzap": 228,
  "move:psychoboost": 229,
  "move:futuresight": 230,
  "move:stoneaxe": 231,
  "move:beakblast": 232,
  "move:shellsidearm": 233,
  "move:circlethrow": 234,
  "move:gigatonhammer": 235,
  "move:precipiceblades": 236,
  "move:terastarstorm": 237,
  "move:boltstrike": 238,
  "move:eruption": 239,
  "move:nightshade": 240,
  "move:spacialrend": 241,
  "move:waterpulse": 242,
  "move:raindance": 243,
  "move:electrodrift": 244,
  "move:crabhammer": 245,
  "move:fierywrath": 246,
  "move:originpulse": 247,
  "move:pounce": 248,
  "move:tailglow": 249,
  "move:avalanche": 250,
  "move:gigaimpact": 251,
  "move:nightslash": 252,
  "move:thunderclap": 253,
  "move:vacuumwave": 254,
  "move:whirlpool": 255,
  "move:flowertrick": 256,
  "move:grassyglide": 257,
  "move:struggle": 258,
  "move:fleurcannon": 259,
  "move:ruination": 260,
  "move:drillrun": 261,
  "move:mudshot": 262,
  "move:ragefist": 263,
  "move:tachyoncutter": 264,
  "move:dragondarts": 265,
  "move:kowtowcleave": 266,
  "move:luminacrash": 267,
  "move:trickroom": 268,
  "move:gravapple": 269,
  "move:noretreat": 270,
  "move:strangesteam": 271,
  "move:lashout": 272,
  "move:reflect": 273,
  "move:mightycleave": 274,
  "move:armorcannon": 275,
  "move:aquacutter": 276,
  "move:overdrive": 277,
  "move:triplearrows": 278,
  "move:doubleshock": 279,
  "move:hex": 280,
  "move:icehammer": 281,
  "move:photongeyser": 282,
  "move:dragonascent": 283,
  "move:esperwing": 284,
  "move:x-scissor": 285,
  "move:lusterpurge": 286,
  "move:meteormash": 287,
  "move:victorydance": 288,
  "move:blueflare": 289,
  "move:direclaw": 290,
  "move:hyperspacefury": 291,
  "move:surgingstrikes": 292,
  "move:volttackle": 293,
  "move:astralbarrage": 294,
  "move:bloodmoon": 295,
  "move:bite": 296,
  "move:shadowclaw": 297,
  "move:expandingforce": 298,
  "move:makeitrain": 299,
  "move:lightscreen": 300,
  "move:firepunch": 301,
  "move:explosion": 302,
  "move:psyblade": 303,
  "move:shoreup": 304,
  "move:behemothblade": 305,
  "move:magmastorm": 306,
  "move:hydrosteam": 307,
  "move:dragonenergy": 308,
  "move:healbell": 309,
  "move:dynamicpunch": 310,
  "move:glaciallance": 311,
  "move:beatup": 312,
  "move:wickedblow": 313,
  "move:dragonclaw": 314,
  "move:poisonfang": 315,
  "move:brickbreak": 316,
  "move:accelerock": 317,
  "move:clangingscales": 318,
  "move:rocktomb": 319,
  "move:thunderpunch": 320,
  "move:destinybond": 321,
  "move:irontail": 322,
  "move:bugbite": 323,
  "move:petalblizzard": 324,
  "move:relicsong": 325,
  "move:snowscape": 326,
  "move:clangoroussoul": 327,
  "move:payback": 328,
  "move:ragingbull": 329,
  "move:razorshell": 330,
  "move:workup": 331,
  "move:bittermalice": 332,
  "move:chillyreception": 333,
  "move:powertrip": 334,
  "move:spiritshackle": 335,
  "move:tailwind": 336,
  "move:glaiverush": 337,
  "move:pollenpuff": 338,
  "move:magnetrise": 339,
  "move:focuspunch": 340,
  "move:icefang": 341,
  "move:disable": 342,
  "move:clearsmog": 343,
  "move:switcheroo": 344,
  "move:temperflare": 345,
  "move:filletaway": 346,
  "move:petaldance": 347,
  "move:mirrorcoat": 348,
  "move:teleport": 349,
  "move:fusionflare": 350,
  "move:collisioncourse": 351,
  "move:healingwish": 352,
  "move:firefang": 353,
  "move:fusionbolt": 354,
  "move:mortalspin": 355,
  "move:courtchange": 356
}